{
    "AD": {
        "facts": [
            "It is the world's only **co-principality**, with two co-princes: the **President of France** and the **Bishop of Urgell** (Spain).",
            "The capital, **Andorra la Vella**, is the **highest capital city in Europe** by elevation.",
            "This country has **no army**; its defense is provided by Spain and France.",
            "It is the only country in the world where **Catalan** is the sole official language."
        ],
        "name": "Andorra"
    },
    "AE": {
        "facts": [
            "The **Burj Khalifa** in Dubai is the **tallest building in the world** (as of 2024).",
            "The UAE is a federation of **seven emirates**: Abu Dhabi, Dubai, Sharjah, Ajman, Umm Al Quwain, Fujairah, and Ras Al Khaimah.",
            "The country's national symbol is the **Falcon**.",
            "A vast majority of the country's residents are **expatriates** and non-citizens, with over 200 nationalities living and working there."
        ],
        "name": "United Arab Emirates"
    },
    "AF": {
        "facts": [
            "The national sport is **Buzkashi** (literally 'goat dragging'), a rugged team game played on horseback where riders compete to place a goat or calf carcass in a goal circle.",
            "The **world's oldest oil paintings** (dating from the 7th century AD) were discovered in the caves of Bamiyan, depicting Buddhas and mythical creatures.",
            "Historically, it served as a major crossroads on the **Silk Road**, linking the civilizations of the Middle East, Central Asia, and India.",
            "This country has one of the **youngest populations** in the world, with a significant percentage of the population under the age of 25."
        ],
        "name": "Afghanistan"
    },
    "AG": {
        "facts": [
            "The country claims to have **365 beaches**, one for every day of the year.",
            "The main island, Antigua, is shaped like a heart and is known for its sheltered harbors and historical **Nelson's Dockyard**.",
            "The smaller island of **Barbuda** was nearly wiped clean by Hurricane Irma in 2017.",
            "The national bird is the rare and distinctive **Frigatebird**."
        ],
        "name": "Antigua and Barbuda"
    },
    "AI": {
        "facts": [
            "This British Overseas Territory is known for its beautiful coral reefs and pristine white-sand beaches, with tourism being the main industry.",
            "The name is derived from the Italian word for 'eel' due to the island's long, narrow shape.",
            "The national sport is **boat racing**, with competitive races held on holidays and special occasions.",
            "The flag features three dolphins symbolizing endurance, unity, and strength."
        ],
        "name": "Anguilla"
    },
    "AL": {
        "facts": [
            "For many years during the Cold War, it followed a policy of extreme **isolationism**, largely cutting itself off from the outside world.",
            "The country is known for its thousands of small, dome-shaped **concrete bunkers** built during the communist era.",
            "The traditional code of honor, the **Kanun**, involves a custom known as *Gjakmarrja* (blood feud), which is still a challenge in some remote areas.",
            "The people call their country **'Shqipëri'**, which translates to 'Land of the Eagles'."
        ],
        "name": "Albania"
    },
    "AM": {
        "facts": [
            "It was the **first nation in the world** to adopt Christianity as its official state religion (in 301 AD).",
            "The capital, **Yerevan**, is one of the world's oldest continuously inhabited cities.",
            "The sacred mountain **Mount Ararat**, a national symbol, is now located within the borders of Turkey.",
            "The beautiful freshwater **Lake Sevan** is one of the largest high-altitude lakes in the world."
        ],
        "name": "Armenia"
    },
    "AO": {
        "facts": [
            "It is the second-largest country in the world where **Portuguese** is the official language (after Brazil).",
            "The **Giant Sable Antelope** (*Palanca Negra Gigante*), an endangered sub-species, is endemic to this territory and was rediscovered in 2004.",
            "The northern province of **Cabinda** is a non-contiguous exclave, separated from the rest of the nation by the Democratic Republic of the Congo.",
            "The capital, **Luanda**, has historically been ranked as one of the most expensive cities in the world for expatriates."
        ],
        "name": "Angola"
    },
    "AQ": {
        "facts": [
            "It is the **coldest, driest, and windiest continent** on Earth and is technically classified as a **desert**.",
            "Approximately **90% of the world's ice** and about 70% of the world's freshwater is frozen in the Antarctic Ice Sheet.",
            "No single country owns this place; it is governed by a specific **Treaty System**, which reserves the continent for **peaceful, scientific research**.",
            "There are **no permanent human inhabitants**; the people present are scientists and support staff on rotation."
        ],
        "name": "Antarctica"
    },
    "AR": {
        "facts": [
            "It is the birthplace of the **Tango** dance.",
            "Home to **Mount Aconcagua**, the tallest mountain in both the Southern and Western Hemispheres.",
            "This country was the first country in the Americas to legalize **same-sex marriage** (in 2010).",
            "The national sport is **Pato** (Spanish for 'duck'), a fast-paced game played on horseback that combines elements of polo and basketball."
        ],
        "name": "Argentina"
    },
    "AS": {
        "facts": [
            "This is an unincorporated territory of the United States, located in the South Pacific Ocean.",
            "The national park covers five small islands and a portion of the main island, featuring tropical rainforests and coral reefs.",
            "The main island, **Tutuila**, is formed by two large volcanic shields.",
            "**Fagatele Bay** is the only underwater national marine sanctuary in the territory, known for its diverse coral ecosystem."
        ],
        "name": "American Samoa"
    },
    "AT": {
        "facts": [
            "It is the birthplace of many famous classical composers, including **Mozart and Strauss**, and the **Waltz dance**.",
            "The flag of this country is one of the **oldest national flag designs** in the world, dating back to 1230.",
            "The **Schönbrunn Zoo** in Vienna, founded in 1752, is the **oldest continuously operating zoo in the world**.",
            "About **62% of the country's territory** is covered by the **Alps**."
        ],
        "name": "Austria"
    },
    "AU": {
        "facts": [
            "It is the only continent that is governed as a single country.",
            "The **Great Barrier Reef**, the world's largest coral reef system, is located off its northeastern coast.",
            "The famous **Sydney Opera House** was designed by Danish architect Jørn Utzon and was opened in 1973.",
            "Around **90%** of the population lives within 100 miles of the coast, leaving the vast interior (the 'Outback') sparsely populated."
        ],
        "name": "Australia"
    },
    "AW": {
        "facts": [
            "The island's unofficial motto is **'One Happy Island'**.",
            "It is a constituent country of the **Kingdom of the Netherlands**.",
            "The distinctive, trade-wind-bent **Divi-Divi tree** is a common natural compass, with its branches pointing consistently southwest.",
            "It is a popular destination because it lies **outside the main hurricane belt**, giving it a low risk of tropical storms."
        ],
        "name": "Aruba"
    },
    "AX": {
        "facts": [
            "This autonomous region of Finland is **monolingual Swedish-speaking**.",
            "It has been demilitarized and neutralized since the **Treaty of Paris in 1856**, meaning no military installations or forces are allowed.",
            "The islands have their own parliament, flag, and issue their own stamps, but they use the **Euro** as currency.",
            "The main industry is a combination of ferry traffic, trade, and financial services."
        ],
        "name": "Åland Islands"
    },
    "AZ": {
        "facts": [
            "Often called the **'Land of Fire'**, a name linked to its historical fire-worshipping traditions and abundant natural gas reserves, such as the continuously burning Yanar Dag.",
            "This is one of the few places considered the **birthplace of the oil industry**, with the world's first industrial oil well drilled near its capital in 1847.",
            "The nation is home to nearly **half of the world's mud volcanoes**.",
            "The territory was the **first predominantly Muslim nation** to grant women the right to vote in 1918."
        ],
        "name": "Azerbaijan"
    },
    "BA": {
        "facts": [
            "The capital, **Sarajevo**, hosted the **1984 Winter Olympics**.",
            "The beautiful **Stari Most** (Old Bridge) in the city of Mostar is a famous historical landmark, reconstructed after the war.",
            "The country has three official co-existing ethnic groups: **Bosniaks, Serbs, and Croats**.",
            "A small section of its territory gives it a coastline on the **Adriatic Sea**."
        ],
        "name": "Bosnia and Herzegovina"
    },
    "BB": {
        "facts": [
            "It is the birthplace of the famous singer **Rihanna**.",
            "The **Flying Fish** is a national symbol and is prominently featured on the country's currency.",
            "It is the easternmost island in the Lesser Antilles.",
            "The national beverage is **rum**, with its distilleries dating back to the 17th century."
        ],
        "name": "Barbados"
    },
    "BD": {
        "facts": [
            "It is the home of the **Sundarbans**, the world's largest single block of tidal halophytic mangrove forest, which is also home to the **Royal Bengal Tiger**.",
            "This country is one of the **most densely populated** major nations in the world, with its capital, Dhaka, being one of the world's fastest-expanding megacities.",
            "The country has one of the world's longest natural sea beaches, **Cox's Bazar**, which stretches for about 120 km (75 mi).",
            "It achieved independence from Pakistan in 1971 following a liberation war."
        ],
        "name": "Bangladesh"
    },
    "BE": {
        "facts": [
            "This country has three official languages: Dutch, French, and German.",
            "The country holds a world record for the longest period without an official government (652 days in 2010-2011).",
            "Belgian scientists are credited with inventing the Big Bang theory, the saxophone, and the Body Mass Index (BMI).",
            "The country produces over 220,000 tons of chocolate annually and is famous for its beer, with over 1,000 different varieties."
        ],
        "name": "Belgium"
    },
    "BF": {
        "facts": [
            "The name translates to **'Land of Incorruptible People'** in two local languages.",
            "It is a landlocked country in West Africa, with the **capital, Ouagadougou**, being a major cultural center.",
            "The annual **FESPACO** (Panafrican Film and Television Festival of Ouagadougou) is one of the most important film festivals in Africa.",
            "The main export is **gold**, a major contributor to the economy."
        ],
        "name": "Burkina Faso"
    },
    "BG": {
        "facts": [
            "This country is one of the **oldest countries in Europe**, established in 681 AD and never changing its name since.",
            "It is the land of origin of the **Cyrillic alphabet**, which is now used by numerous Slavic languages.",
            "The people of this country traditionally **shake their head for 'Yes'** and nod for 'No'—the opposite of most Western cultures.",
            "It is the world's largest producer of **rose oil** (often called 'liquid gold') from the roses grown in the Kazanlak Rose Valley."
        ],
        "name": "Bulgaria"
    },
    "BH": {
        "facts": [
            "It is an **archipelago of 33 low-lying islands** in the Persian Gulf, connected by causeways.",
            "It was the first country in the Gulf region to discover and begin processing **crude oil**.",
            "The **Tree of Life** (*Shajarat-al-Hayat*) is a solitary, 400-year-old mesquite tree that stands alone in a desert area, with no obvious source of water.",
            "The capital, **Manama**, is home to the Bahrain International Circuit, which hosts the Formula 1 Grand Prix."
        ],
        "name": "Bahrain"
    },
    "BI": {
        "facts": [
            "It is a small, landlocked country in the African Great Lakes region.",
            "It is often cited as one of the world's poorest countries, with the majority of the population engaged in subsistence agriculture.",
            "The southernmost source of the **Nile River** is claimed to be in this country.",
            "It shares the massive **Lake Tanganyika** with Tanzania, DR Congo, and Zambia."
        ],
        "name": "Burundi"
    },
    "BJ": {
        "facts": [
            "This country was formerly known as the Kingdom of Dahomey, famous for its formidable all-female military corps, the 'Dahomey Amazons'.",
            "The country's official capital is Porto-Novo, but the largest city and seat of government is Cotonou.",
            "Voodoo (Vodun) originated in this region of West Africa and is an official religion in this country.",
            "The coastal area of this country was historically known as 'The Slave Coast'."
        ],
        "name": "Benin"
    },
    "BL": {
        "facts": [
            "This Caribbean island is a **French overseas collectivity** and is officially part of the European Union, despite its location.",
            "The island's capital, **Gustavia**, was named after a Swedish king and features remnants of the Swedish colonial era, including its old forts.",
            "It is globally renowned as a **luxurious, high-end destination** with exclusive resorts and designer boutiques, often attracting celebrity visitors.",
            "Due to limited fresh water resources, the territory relies heavily on **desalination of seawater** and rainwater collection."
        ],
        "name": "Saint Barthélemy"
    },
    "BM": {
        "facts": [
            "This British Overseas Territory is famous for the stretch of the Atlantic Ocean known as the **'Bermuda Triangle'**.",
            "The beaches are known for their unique **pink sand**, which is a result of crushed shell and coral particles.",
            "The traditional business attire includes **Bermuda shorts**, often worn with knee-socks, a blazer, and tie.",
            "The oldest self-governing parliament in the Commonwealth outside of the UK is located here."
        ],
        "name": "Bermuda"
    },
    "BN": {
        "facts": [
            "This small nation on the island of **Borneo** is one of the world's richest countries per capita due to its oil and natural gas fields.",
            "The country is governed by a **Sultan**, who also serves as the Prime Minister.",
            "The capital, **Bandar Seri Begawan**, is home to the magnificent Jame' Asr Hassanil Bolkiah Mosque.",
            "The large, traditional water village of **Kampong Ayer** has been continuously settled for over a millennium."
        ],
        "name": "Brunei"
    },
    "BO": {
        "facts": [
            "It is one of only two landlocked countries in South America (the other being Paraguay).",
            "It has **two capital cities**: La Paz (administrative and governmental) and Sucre (constitutional and judicial).",
            "The **Salar de Uyuni**, the world's largest salt flat, is a major natural wonder here, covering over 10,000 square kilometers.",
            "Indigenous peoples, particularly the Aymara and Quechua, make up a significant portion of the population."
        ],
        "name": "Bolivia"
    },
    "BQ": {
        "facts": [
            "These are three special municipalities of the Netherlands in the Caribbean, collectively known as the **Caribbean Netherlands**.",
            "**Saba** is home to **Mount Scenery**, the **highest point in the entire Kingdom of the Netherlands**.",
            "**Bonaire** has striking **pink beaches** and vast, protected **flamingo breeding grounds**.",
            "**Sint Eustatius** is historically significant, being the **first foreign government to officially recognize the United States of America** in 1776."
        ],
        "name": "Bonaire, Sint Eustatius and Saba"
    },
    "BR": {
        "facts": [
            "It is the **only country in South America** whose official language is **Portuguese**.",
            "The nation has won the **FIFA World Cup** a record five times.",
            "About **60% of the Amazon rainforest** is located within its borders.",
            "The **Carnival** in Rio de Janeiro is widely considered the world's largest, featuring massive samba school parades."
        ],
        "name": "Brazil"
    },
    "BS": {
        "facts": [
            "This archipelago consists of over 700 islands and cays, but only about 30 are inhabited.",
            "The capital, Nassau, is a major stop for cruise ships and is famous for its colorful marketplace and historic colonial architecture.",
            "The lively street festival known as **Junkanoo**, featuring music, dance, and elaborate costumes, is celebrated on Boxing Day and New Year's Day.",
            "It is home to the famous 'Swimming Pigs' on the uninhabited island of **Big Major Cay**."
        ],
        "name": "Bahamas"
    },
    "BT": {
        "facts": [
            "The nation is the **only carbon-negative country in the world**; it absorbs more carbon dioxide than it produces.",
            "Instead of Gross Domestic Product (GDP), it famously measures the success of the country by **Gross National Happiness (GNH)**.",
            "The official name for the country is **'Druk Yul'**, meaning **'Land of the Thunder Dragon'**.",
            "Until 1999, **television and the internet were banned** to protect its culture from outside influence."
        ],
        "name": "Bhutan"
    },
    "BV": {
        "facts": [
            "This uninhabited sub-Antarctic island is a dependent territory of Norway and is considered the **most remote island in the world**.",
            "Over **90% of the island is covered by glaciers**.",
            "It is the location of the setting of the movie **'Alien vs. Predator'**.",
            "The island is difficult to access due to thick ice and severe weather."
        ],
        "name": "Bouvet Island"
    },
    "BW": {
        "facts": [
            "It is home to the **Okavango Delta**, a massive inland delta where the Okavango River empties onto a vast plain, rather than flowing into the sea.",
            "It is one of the world's largest producers of **diamonds** by value.",
            "The national currency is the **Pula**, which also means 'rain' in Setswana, reflecting the vital importance of water.",
            "A significant portion of the **Kalahari Desert** is located within its borders."
        ],
        "name": "Botswana"
    },
    "BY": {
        "facts": [
            "The capital, **Minsk**, was virtually rebuilt after World War II, resulting in a lot of Stalinist-era architecture.",
            "It is a landlocked country in Eastern Europe, bordering Russia, Ukraine, Poland, Lithuania, and Latvia.",
            "Large tracts of the country are covered by **forests and swamps**, including the immense Belovezhskaya Pushcha forest.",
            "The traditional national dish is **Draniki**, which are thick potato pancakes."
        ],
        "name": "Belarus"
    },
    "BZ": {
        "facts": [
            "It is the only country in Central America where **English** is the official language.",
            "It is home to the **Great Blue Hole**, the world's largest sinkhole, and the second-largest barrier reef system (Mesoamerican) after Australia's.",
            "This country's capital was moved inland to **Belmopan** from Belize City after Hurricane Hattie devastated the old capital in 1961.",
            "It is home to the world's **only jaguar nature preserve**, the Cockscomb Basin Wildlife Sanctuary."
        ],
        "name": "Belize"
    },
    "CA": {
        "facts": [
            "It has the **longest coastline** of any country in the world, bordering three oceans (Atlantic, Arctic, and Pacific).",
            "It is the **second-largest country** in the world by total area.",
            "The national sport is **lacrosse** (summer) and **ice hockey** (winter).",
            "The **Niagara Falls** are a major natural attraction, shared with the United States."
        ],
        "name": "Canada"
    },
    "CC": {
        "facts": [
            "This territory consists of 27 coral islands in two atolls, but only two of the islands are inhabited.",
            "The population is split between predominantly ethnic Malays who are mostly Sunni Muslim, and a smaller number of European expatriates.",
            "The only way to reach this remote place is by flying from Perth, Western Australia, as there are no direct flights from other countries.",
            "The main industry is small-scale tourism and the production of copra (dried coconut meat)."
        ],
        "name": "Cocos (Keeling) Islands"
    },
    "CD": {
        "facts": [
            "It is the second-largest country in Africa by area and the largest sub-Saharan African nation.",
            "The **Congo River**, which flows through the country, is the deepest river in the world and the second-largest by volume.",
            "It is one of the most resource-rich countries globally, with vast deposits of minerals like **cobalt and coltan**.",
            "The dense **Congo Rainforest** is the second-largest tropical rainforest in the world after the Amazon."
        ],
        "name": "Democratic Republic of the Congo"
    },
    "CF": {
        "facts": [
            "The country has huge, largely unexploited reserves of **diamonds, gold, and uranium**, yet remains one of the poorest globally.",
            "It is home to diverse ecosystems, including **savannas and tropical forests**, and a rich biodiversity.",
            "The nation is **landlocked** and its major rivers, like the Ubangi, drain into the Congo River basin.",
            "Approximately **80 distinct ethnic groups** contribute to the country's cultural diversity."
        ],
        "name": "Central African Republic"
    },
    "CG": {
        "facts": [
            "It lies within a major river basin, which holds the world's second-largest tropical **rainforest**.",
            "The country's economy is heavily reliant on **oil exports**, which account for a vast majority of its revenue.",
            "The capital, **Brazzaville**, is located directly across the Congo River from **Kinshasa**, making them the two closest capital cities in the world (excluding Rome/Vatican City).",
            "The country has become known for the **'La Sape'** subculture, originating from its capital, which emphasizes elegant designer clothing."
        ],
        "name": "Republic of the Congo"
    },
    "CH": {
        "facts": [
            "It is famous for its policy of **armed neutrality** and has not been involved in a foreign war since 1815.",
            "The country is highly decentralized and divided into **26 Cantons**, which retain a high degree of autonomy.",
            "The **Red Cross** organization was founded in Geneva in 1863.",
            "The country is home to the stunning peaks of the **Alps**, which cover a majority of its territory."
        ],
        "name": "Switzerland"
    },
    "CI": {
        "facts": [
            "It is the world's **largest producer of cocoa beans**.",
            "It is home to the **Basilica of Our Lady of Peace of Yamoussoukro**, which has a larger exterior area than St. Peter's Basilica, making it one of the largest churches in the world.",
            "The country has two capital cities: **Yamoussoukro** (official/political) and **Abidjan** (economic center).",
            "The country's popular subculture, **'La Sape'** (Society of Ambiance-Makers and Elegant People), is famous for its members' colorful, high-fashion designer attire."
        ],
        "name": "Côte d'Ivoire"
    },
    "CK": {
        "facts": [
            "This self-governing island nation is in **free association with New Zealand**, which manages its defense and foreign affairs.",
            "The islands are named after the British explorer **Captain James Cook**, who sighted them in the 1770s.",
            "The capital, **Avarua**, is located on the largest island, Rarotonga.",
            "The main export is **black pearls**, particularly from the island of Manihiki."
        ],
        "name": "Cook Islands"
    },
    "CL": {
        "facts": [
            "This country is the world's longest country, stretching over 4,300 km (2,670 miles) along the Pacific coast.",
            "The Atacama Desert in northern part of this country is the driest non-polar desert on Earth, with some areas having no rainfall for centuries.",
            "This country is home to the world's oldest mummies, created by the Chinchorro people around 5050 BC.",
            "Due to its clear skies and high altitude, it is a global center for astronomical observatories."
        ],
        "name": "Chile"
    },
    "CM": {
        "facts": [
            "It is known as **'Africa in miniature'** due to its geographical and cultural diversity, including coast, desert, mountains, and rainforest.",
            "It has both **English and French** as official languages, reflecting its history as a former German, British, and French colony.",
            "The massive active volcano **Mount Cameroon** is the highest point in West Africa.",
            "Football is extremely popular, and the national team is nicknamed the **'Indomitable Lions'**."
        ],
        "name": "Cameroon"
    },
    "CN": {
        "facts": [
            "It is the **world's most populous country** and the fourth largest by total area.",
            "The **Great Wall**, the longest man-made structure in the world, was built to protect its northern borders.",
            "The country is the birthplace of many key inventions, including **paper, printing, gunpowder, and the compass**.",
            "The capital, Beijing, is home to the **Forbidden City**, the former imperial palace of the Ming and Qing dynasties."
        ],
        "name": "China"
    },
    "CO": {
        "facts": [
            "It is the world's largest source of high-quality **emeralds**.",
            "The country is named after **Christopher Columbus**, though he never actually set foot here.",
            "It is the only country in South America with coastlines on **both the Atlantic (Caribbean) and Pacific Oceans**.",
            "The capital, **Bogotá**, is home to the world's largest gold museum (Museo del Oro)."
        ],
        "name": "Colombia"
    },
    "CR": {
        "facts": [
            "It has legally **abolished its army** since 1948 and instead invests heavily in education and health care.",
            "The country is a global leader in **ecotourism** and boasts incredible biodiversity, containing about 5% of the world's species.",
            "The local motto, **'Pura Vida'** (Pure Life), is used as a greeting and a philosophy.",
            "A significant portion of its electricity is generated from **renewable sources**."
        ],
        "name": "Costa Rica"
    },
    "CU": {
        "facts": [
            "The main island is often nicknamed **'El Cocodrilo'** (The Crocodile) due to its long, narrow shape on a map.",
            "It is one of only two countries in the world where the sale of **Coca-Cola is legally prohibited**, largely due to the long-standing U.S. trade embargo.",
            "This country has one of the world's highest **literacy rates** (around 99.8%), achieved after a massive literacy campaign in the early 1960s.",
            "The country is a **time capsule of vintage cars**, known for its thousands of pre-1959 American automobiles."
        ],
        "name": "Cuba"
    },
    "CV": {
        "facts": [
            "The archipelago consists of **ten volcanic islands** in the central Atlantic Ocean.",
            "The main language, **Kriolu** (or Cape Verdean Creole), is based on Portuguese but is a recognized Creole language.",
            "The city of **Cidade Velha** on Santiago Island is a UNESCO World Heritage site and was the **first European colonial outpost in the tropics**.",
            "The country is famous for its lively **Morna** music, a mournful and expressive musical genre often compared to Portuguese Fado."
        ],
        "name": "Cabo Verde"
    },
    "CW": {
        "facts": [
            "This Dutch Caribbean island is famous for its brightly colored, colonial-style architecture in the capital, **Willemstad**, which is a UNESCO World Heritage site.",
            "The unique liqueur, **Blue Curaçao**, gets its vibrant color and citrus flavor from the dried peels of the Laraha citrus fruit, which is native to the island.",
            "The local language is **Papiamentu**, a Creole language derived from Spanish, Portuguese, Dutch, and African languages.",
            "It remains a constituent country of the Kingdom of the Netherlands."
        ],
        "name": "Curaçao"
    },
    "CX": {
        "facts": [
            "This Australian external territory is famous for its annual mass migration of **red crabs**, which travel from the forest to the sea to spawn.",
            "The island is the top of an **undersea mountain** (Guyot) rising over 5,000 meters from the ocean floor.",
            "The primary industries are phosphate mining and government administration.",
            "It has a significant population of people of **Chinese and Malay descent**."
        ],
        "name": "Christmas Island"
    },
    "CY": {
        "facts": [
            "According to Greek mythology, this country is the birthplace of the goddess of love, Aphrodite.",
            "The capital city, Nicosia, is the last divided capital in the world, split by a UN buffer zone known as the 'Green Line'.",
            "This country is home to the world's oldest manufactured wine still in production, the sweet dessert wine Commandaria.",
            "The national flag is the only one in the world to feature the map of the country itself."
        ],
        "name": "Cyprus"
    },
    "CZ": {
        "facts": [
            "It has the **highest beer consumption per capita in the world**, and the first Pilsner-style lager originated here in 1842.",
            "It's home to the **Prague Castle**, the **largest ancient castle complex in the world**.",
            "The word **'robot'** was introduced to the world by author Karel Čapek and his brother Josef in 1920.",
            "The capital, **Prague**, is nicknamed 'the city of a hundred spires'."
        ],
        "name": "Czech Republic"
    },
    "DE": {
        "facts": [
            "The largest section of the **'Autobahn'** highway system has no mandated speed limit, though advisory limits are common.",
            "It is the birthplace of the **Reformation**, famously started by Martin Luther in 1517.",
            "The country is composed of **16 federal states** (Länder), each with its own constitution.",
            "The capital, Berlin, was famously divided by a **wall** from 1961 to 1989."
        ],
        "name": "Germany"
    },
    "DJ": {
        "facts": [
            "It is strategically located at the mouth of the **Red Sea**, making it a host for multiple foreign military bases.",
            "It is one of the hottest and driest places on Earth, with vast salt lakes and volcanic plateaus.",
            "**Lake Assal**, an extremely saline crater lake, is the lowest point in Africa.",
            "The country is named after its capital city, which is also the country's main port."
        ],
        "name": "Djibouti"
    },
    "DK": {
        "facts": [
            "It is often ranked as one of the **happiest countries** in the world, frequently attributed to its concept of 'Hygge' (coziness and well-being).",
            "The **monarchy** is one of the oldest in the world, tracing its lineage back to the Viking Age.",
            "It is the home country of the famous fairy-tale writer **Hans Christian Andersen** (*The Little Mermaid*, *The Ugly Duckling*).",
            "The country's highest natural point, **Møllehøj**, is only about 170 meters (560 feet) above sea level."
        ],
        "name": "Denmark"
    },
    "DM": {
        "facts": [
            "It is known as the **'Nature Isle of the Caribbean'** due to its lush, mountainous rainforests and natural hot springs.",
            "The island is home to the world's second-largest **boiling lake**.",
            "It is the only eastern Caribbean island with a remaining population of indigenous **Kalinago** people.",
            "The island's economy is primarily dependent on tourism and agriculture."
        ],
        "name": "Dominica"
    },
    "DO": {
        "facts": [
            "It shares the island of **Hispaniola** with Haiti, making it one of two Caribbean nations to share an island.",
            "The sport of **baseball** is extremely popular and the country has produced numerous Major League Baseball players.",
            "It is home to the highest peak in the Caribbean, **Pico Duarte**.",
            "The national dance and music style is the lively and popular **Merengue**."
        ],
        "name": "Dominican Republic"
    },
    "DZ": {
        "facts": [
            "It is the **largest country in Africa** by area, with most of its territory covered by the Sahara Desert.",
            "The Roman ruins of **Timgad** and **Tipaza** are major historical sites.",
            "The vast majority of the population lives along the **Mediterranean coast**.",
            "The traditional music known as **Raï** originated in the western part of the country."
        ],
        "name": "Algeria"
    },
    "EC": {
        "facts": [
            "Its name literally means **'equator'** in Spanish, as the line runs through the country.",
            "In 2008, it became the **first country to officially recognize the constitutional rights of nature**.",
            "The summit of the **Chimborazo volcano** is the **closest point on Earth to the sun** due to the planet's equatorial bulge.",
            "The famous straw hat known globally as the **'Panama Hat'** actually originated in this country."
        ],
        "name": "Ecuador"
    },
    "EE": {
        "facts": [
            "It is one of the most **digitally advanced societies** in the world, with e-voting, e-residency, and high-speed internet access.",
            "The capital, **Tallinn**, has a remarkably well-preserved medieval Old Town, a UNESCO World Heritage site.",
            "The country has a strong connection to **singing and choral traditions**, with massive song festivals held regularly.",
            "It has a relatively low population density, with vast areas covered by forests and swamps."
        ],
        "name": "Estonia"
    },
    "EG": {
        "facts": [
            "It is home to the **Great Pyramid of Giza**, the oldest and largest of the three pyramids in the Giza Necropolis and the only one of the **Seven Wonders of the Ancient World** still largely intact.",
            "The **Rosetta Stone**, crucial to deciphering hieroglyphs, was found in a town in the Nile Delta in 1799.",
            "The **Nile River**, the longest river in the world, flows through the heart of the country from south to north, and most of the population lives along its banks.",
            "The traditional dish **Koshari** is a mixture of rice, macaroni, and lentils, topped with a spicy tomato-garlic sauce and fried onions."
        ],
        "name": "Egypt"
    },
    "EH": {
        "facts": [
            "It is a disputed territory, largely controlled by **Morocco**, with the remainder controlled by the **Polisario Front**.",
            "The territory is primarily composed of **desert and semi-desert terrain**, with minimal rainfall.",
            "It has one of the **lowest population densities** in the world.",
            "The region has significant offshore **phosphate reserves** and a rich Atlantic **fishing ground**."
        ],
        "name": "Western Sahara"
    },
    "ER": {
        "facts": [
            "It has an extensive coastline along the **Red Sea**, and the Dahlak Archipelago is a major feature.",
            "The capital, **Asmara**, is famous for its unique collection of Modernist and Art Deco architecture from the Italian colonial period, earning it UNESCO status.",
            "Service in the **national military** can be indefinite, which is a major point of international concern.",
            "The country gained independence from Ethiopia in 1993 after a 30-year war."
        ],
        "name": "Eritrea"
    },
    "ES": {
        "facts": [
            "It is the only country in Europe that shares a physical border with an African nation (Morocco, through the enclaves of Ceuta and Melilla).",
            "The country is famous for the traditional dance of **Flamenco** and the annual 'Running of the Bulls' festival.",
            "The unfinished masterpiece, the **Sagrada Família** basilica in Barcelona, was designed by Antoni Gaudí.",
            "It is the world's largest producer of **olive oil**."
        ],
        "name": "Spain"
    },
    "ET": {
        "facts": [
            "It is the **only African country never to be formally colonized** by a European power, successfully defeating the Italian army in 1896.",
            "This country uses its **own calendar**, which has 13 months and runs approximately 7 to 8 years behind the Gregorian calendar.",
            "It is widely considered the **birthplace of coffee** (specifically the *Coffea arabica* plant), with the legend of the goat-herder Kaldi credited with its discovery.",
            "The **Danakil Depression**, located here, is one of the hottest and lowest places on Earth, featuring unique geological formations like colorful acidic springs."
        ],
        "name": "Ethiopia"
    },
    "FI": {
        "facts": [
            "The nation is frequently ranked as the **happiest country in the world**.",
            "It is a country of 5.4 million people that is home to over **3 million saunas**—more saunas than cars.",
            "The country was the **first in Europe** to give women the right to vote and stand for parliament in 1906.",
            "It is known as the 'Land of the Midnight Sun' and the 'Land of the Aurora Borealis' since a quarter of its area lies north of the Arctic Circle."
        ],
        "name": "Finland"
    },
    "FJ": {
        "facts": [
            "The traditional welcoming ceremony, the **'Kava Ceremony'** (Yaqona), involves drinking a mild sedative beverage made from the root of the pepper plant.",
            "The national rugby team performs a traditional war dance called the **'Cibi'** before matches.",
            "The archipelago consists of over 300 islands, with the two main islands being **Viti Levu** and **Vanua Levu**.",
            "The people are known for the traditional greeting, **'Bula!'**."
        ],
        "name": "Fiji"
    },
    "FK": {
        "facts": [
            "This country's islands are an archipelago known for their immense biodiversity, especially their five species of breeding penguins.",
            "The capital, Stanley, is one of the southernmost capital cities in the world.",
            "The islands are a British Overseas Territory, whose sovereignty is disputed by Argentina.",
            "The local motto is 'Desire the Right,' inspired by the name of the ship on which the islands were first recorded by a British explorer."
        ],
        "name": "Falkland Islands"
    },
    "FM": {
        "facts": [
            "The nation is composed of **607 islands** spread across the western Pacific Ocean.",
            "It is home to the megalithic stone city of **Nan Madol**, built on a lagoon using stacked basalt logs, earning it the nickname 'Venice of the Pacific'.",
            "The island of Yap uses **Rai stones**—massive, donut-shaped calcite discs—as a traditional form of currency.",
            "The four stars on the national flag represent the four main island states: Chuuk, Kosrae, Pohnpei, and Yap."
        ],
        "name": "Federated States of Micronesia"
    },
    "FO": {
        "facts": [
            "This self-governing archipelago is a constituent country of the **Kingdom of Denmark**.",
            "The weather is highly changeable, with frequent fog and strong winds, and the landscapes are dominated by steep cliffs and rolling hills.",
            "It is famous for its unique traditional **grass-roofed houses**.",
            "The local population of **sheep** outnumbers the human population."
        ],
        "name": "Faroe Islands"
    },
    "FR": {
        "facts": [
            "It is the **most-visited country** in the world by international tourists.",
            "The country is often referred to as **'L'Hexagone'** (The Hexagon) because of its geometric shape on the map.",
            "A law from 1993 strictly defines the traditional **'baguette'**, allowing only four ingredients: wheat flour, water, salt, and yeast.",
            "The **Eiffel Tower can grow up to 15 cm** in hot weather due to the thermal expansion of its iron structure."
        ],
        "name": "France"
    },
    "GA": {
        "facts": [
            "Approximately **88% of the nation's land is covered by dense rainforests**.",
            "The capital city's name, **Libreville**, means 'free town' in French, a reference to the settlement of freed slaves.",
            "The land is a vital sanctuary, protecting about **60% of the world's endangered forest elephants**.",
            "It is located directly on the Equator, giving it a largely hot and humid tropical climate."
        ],
        "name": "Gabon"
    },
    "GB": {
        "facts": [
            "It is made up of four countries: **England, Scotland, Wales, and Northern Ireland**.",
            "The Prime Meridian, the zero point for measuring longitude, runs through the city of **Greenwich, London**.",
            "It is home to the prehistoric monument of **Stonehenge**.",
            "It has a **constitutional monarchy**, with the Monarch as the head of state."
        ],
        "name": "United Kingdom"
    },
    "GD": {
        "facts": [
            "It is known as the **'Spice Isle'** due to its production of nutmeg, mace, cinnamon, and cloves.",
            "The island's main harbor is the dramatic, crescent-shaped, and deep-water port of **St. George's**.",
            "The national bird is the critically endangered **Grenada Dove**.",
            "The island was devastated by **Hurricane Ivan** in 2004, particularly affecting the nutmeg industry."
        ],
        "name": "Grenada"
    },
    "GE": {
        "facts": [
            "This country is widely considered the birthplace of wine, with archaeological evidence of winemaking dating back 8,000 years.",
            "Its unique script, the Georgian alphabet, is one of only 14 distinct scripts in the world.",
            "The capital city, Tbilisi, gets its name from the Georgian word for 'warm' (`tbili`) due to its natural sulfur hot springs.",
            "The polyphonic (multi-voiced) singing of Georgia is recognized as a masterpiece of the Intangible Cultural Heritage of Humanity by UNESCO."
        ],
        "name": "Georgia"
    },
    "GF": {
        "facts": [
            "This overseas department of France is the site of the **Guiana Space Centre**, Europe's primary launch site for rockets.",
            "It is covered by one of the largest continuous tracts of **tropical rainforest** in the world.",
            "The infamous former penal colony, **Devil's Island** (Île du Diable), is located just off its coast.",
            "The country's coast is often used as a nesting ground for various species of sea turtles."
        ],
        "name": "French Guiana"
    },
    "GG": {
        "facts": [
            "This is a **British Overseas Territory** located in the remote South Atlantic Ocean.",
            "The islands are a critical haven for wildlife, home to an estimated **five million seals** and over 60 million breeding birds.",
            "It is the only place in the world where the endemic **South Georgia pipit**, the world's only sub-Antarctic songbird, can be found.",
            "The territory is the site of one of the world's **largest sustainable use Marine Protected Areas (MPAs)**."
        ],
        "name": "South Georgia and the South Sandwich Islands"
    },
    "GH": {
        "facts": [
            "This country was the first sub-Saharan African nation to gain independence from colonial rule in 1957.",
            "The country is the world's second-largest producer of cocoa beans.",
            "It is home to Lake Volta, the largest artificial reservoir in the world by surface area.",
            "Traditional Kente cloth, known for its vibrant patterns and symbolism, was originally worn exclusively by royalty."
        ],
        "name": "Ghana"
    },
    "GI": {
        "facts": [
            "This British Overseas Territory is dominated by the **Rock of Gibraltar**, a massive limestone promontory.",
            "The only wild monkey population in Europe, the **Barbary Macaques**, lives on the Rock.",
            "Its territory is connected to mainland Spain by a narrow sandy isthmus.",
            "The runway of the international airport is intersected by a **busy main road**."
        ],
        "name": "Gibraltar"
    },
    "GL": {
        "facts": [
            "It is the **world's largest island** that is not a continent.",
            "Approximately **80% of its surface is covered by an ice cap**, which holds about 7% of the world's fresh water.",
            "The territory is a self-governing constituent country within the **Kingdom of Denmark**.",
            "With a population density of about 0.03 people per square kilometer, it is one of the **most sparsely populated** territories in the world."
        ],
        "name": "Greenland"
    },
    "GM": {
        "facts": [
            "It is almost entirely surrounded by **Senegal**, with the exception of its Atlantic coastline.",
            "The entire country is largely contained within the floodplains of the **Gambia River**.",
            "It is the **smallest country on the African mainland** by area.",
            "The traditional **Kora**, a 21-stringed instrument, is a major part of its musical heritage."
        ],
        "name": "Gambia"
    },
    "GN": {
        "facts": [
            "It is sometimes known as the 'water tower' of West Africa because it is the source of several major rivers, including the **Niger, Senegal, and Gambia**.",
            "It is one of the world's largest exporters of **bauxite**, the ore used to produce aluminum.",
            "The capital, **Conakry**, is located on a peninsula and is the country's economic and cultural center.",
            "The country's first president, Ahmed Sékou Touré, was instrumental in gaining independence from France in 1958."
        ],
        "name": "Guinea"
    },
    "GP": {
        "facts": [
            "This overseas region of France is an archipelago shaped like a **butterfly**, with two main islands separated by a narrow channel.",
            "It is home to the active volcano **Soufrière**, the highest peak in the Lesser Antilles.",
            "The local culture blends French and West Indian influences, particularly in its **Creole cuisine and music**.",
            "It is a popular destination for its distinctive blend of beautiful beaches and mountainous rainforests."
        ],
        "name": "Guadeloupe"
    },
    "GQ": {
        "facts": [
            "It is the **only Spanish-speaking country in Africa**, a legacy of its colonial past.",
            "Despite its name, the **Equator does not pass through the country**, except for its southernmost island, Annobón.",
            "The administrative capital, **Malabo**, is located on Bioko Island, which is geographically closer to Cameroon than to the mainland territory.",
            "Due to significant oil revenues, it has one of the highest Gross National Incomes (GNI) per capita in Africa, but also high income inequality."
        ],
        "name": "Equatorial Guinea"
    },
    "GR": {
        "facts": [
            "It is considered the **birthplace of Democracy**, Western philosophy, the Olympic Games, and Western theater.",
            "Ancient Greeks believed **Mount Olympus** was the home of the 12 Olympian gods.",
            "It is a peninsula with a massive amount of coastline and **thousands of islands**, only about 200 of which are inhabited.",
            "In some ancient sites, it is **illegal to wear high heels** as they can cause damage to the monuments."
        ],
        "name": "Greece"
    },
    "GS": {
        "facts": [
            "This British Overseas Territory is a bleak, sub-Antarctic archipelago with no permanent human population.",
            "The island of South Georgia was a major **whaling station** in the early 20th century.",
            "The famous Antarctic explorer **Sir Ernest Shackleton** is buried here.",
            "The islands are home to massive colonies of **King Penguins** and fur seals."
        ],
        "name": "South Georgia and the South Sandwich Islands"
    },
    "GT": {
        "facts": [
            "The **ancient Maya civilization** was highly influential here; the site of **Tikal** is one of the largest Mayan archaeological complexes.",
            "It is the **birthplace of chocolate**, as the ancient Maya revered the cacao bean as 'the food of the Gods'.",
            "It has over **30 volcanoes**, three of which are currently active (Fuego, Pacaya, and Santiaguito).",
            "Old American school buses are famously recycled and used as colorful public transport, known as **'chicken buses'**."
        ],
        "name": "Guatemala"
    },
    "GU": {
        "facts": [
            "This unincorporated territory of the United States is the **largest island in Micronesia**.",
            "It is famous for being the location of the **'day that never was'** on the International Date Line.",
            "The indigenous people are the **Chamorros**, who have a unique language and culture.",
            "Its economy is largely dependent on **tourism** and the presence of US military bases."
        ],
        "name": "Guam"
    },
    "GW": {
        "facts": [
            "It is composed of a mainland section and the **Bijagós Archipelago**, a UNESCO Biosphere Reserve of about 88 islands.",
            "The country is one of the **world's leading producers of cashew nuts**, which are its main cash crop and export.",
            "The unique **saltwater hippos** are known to inhabit the Bijagós Islands, notably on Orango Island."
        ],
        "name": "Guinea-Bissau"
    },
    "GY": {
        "facts": [
            "It is the only South American nation whose official language is **English**.",
            "The spectacular **Kaieteur Falls** on the Potaro River is one of the world's most powerful waterfalls.",
            "The population is largely concentrated on the **coastal plain**.",
            "The country's interior is covered by vast, pristine **rainforests**."
        ],
        "name": "Guyana"
    },
    "HK": {
        "facts": [
            "It is famous for its dramatic, vertical **skyline** and extremely high population density.",
            "The territory was returned to **China** by the United Kingdom in 1997 under a 'one country, two systems' principle.",
            "The city is a major global financial center and one of the world's most successful economies.",
            "The traditional fishing vessel, the **Junk**, is a frequent sight in its harbor."
        ],
        "name": "Hong Kong"
    },
    "HM": {
        "facts": [
            "This external territory of Australia is an uninhabited, sub-Antarctic group of barren volcanic islands.",
            "It is home to **Mawson Peak**, an active volcano which is the highest mountain in all Australian territory.",
            "The islands are protected as a UNESCO World Heritage site due to their pristine ecosystem and geological significance.",
            "The islands are remote and have only been visited by scientists and conservationists."
        ],
        "name": "Heard Island and McDonald Islands"
    },
    "HN": {
        "facts": [
            "The ancient Mayan ruins of **Copán**, a major center of Mayan civilization, are located in the western part of the country.",
            "The capital, **Tegucigalpa**, is situated in a mountainous area and has one of the largest cathedrals in Central America.",
            "The Bay Islands, including **Roatán**, are famous for their coral reefs and excellent diving.",
            "The country's national flower is the **Orchid** (*Rhyncholaelia digbyana*)."
        ],
        "name": "Honduras"
    },
    "HR": {
        "facts": [
            "The famous walled city of **Dubrovnik** served as a major filming location for 'Game of Thrones'.",
            "The country is credited with inventing the **necktie** (cravat), originating from the scarf worn by mercenaries during the 17th century.",
            "It has over a thousand islands along its stunning **Adriatic coastline**.",
            "The **Plitvice Lakes National Park** is famous for its cascading lakes and waterfalls."
        ],
        "name": "Croatia"
    },
    "HT": {
        "facts": [
            "It was the **first free black republic** in the world and the only nation established as a result of a successful slave revolt (1804).",
            "It shares the Caribbean island of **Hispaniola** with the Dominican Republic.",
            "The local religious practice known as **Vodou** is often misunderstood but is a recognized official religion.",
            "The country's economy is highly reliant on agriculture and remittances from abroad."
        ],
        "name": "Haiti"
    },
    "HU": {
        "facts": [
            "The capital, **Budapest**, is famous for its numerous **thermal hot springs and baths**, many dating back to the Roman and Ottoman eras.",
            "The official language, **Hungarian (Magyar)**, is not an Indo-European language; it belongs to the Uralic family.",
            "The country has produced a disproportionately high number of **Nobel Prize winners** and inventors, including the creator of the ballpoint pen.",
            "The local cuisine is well-known for using **paprika** extensively, particularly in the famous *Goulash* stew."
        ],
        "name": "Hungary"
    },
    "ID": {
        "facts": [
            "It is the **world's largest island country**, comprising over 17,000 islands.",
            "It is the **fourth most populous country** in the world and has the largest Muslim population.",
            "It is located on the **Ring of Fire**, making it prone to earthquakes and volcanic eruptions, with over 150 active volcanoes.",
            "The island of **Komodo** is the only place in the world where the Komodo dragon lives in the wild."
        ],
        "name": "Indonesia"
    },
    "IE": {
        "facts": [
            "The world's oldest pub, **Sean's Bar**, dating back to A.D. 900, is claimed to be in this territory.",
            "The country's national symbol is not the shamrock, but the **Gaelic Harp**, making it the only country with a musical instrument as its emblem.",
            "Saint Patrick, the most famous patron saint, was actually **born in Roman Britain**.",
            "The traditions of **Halloween**, such as carving jack-o'-lanterns, originated from the ancient Celtic festival of Samhain observed in this region."
        ],
        "name": "Ireland"
    },
    "IL": {
        "facts": [
            "It has the **highest concentration of high-tech and start-up companies** in the world (outside of Silicon Valley).",
            "The **Dead Sea**, bordering this country, is the **lowest point on Earth** at approximately 1,412 feet below sea level.",
            "It has **more museums per capita** than any other country in the world.",
            "This country is a world leader in water conservation and innovative **irrigation technologies**, such as drip irrigation."
        ],
        "name": "Israel"
    },
    "IM": {
        "facts": [
            "It has the **longest continuously running parliament in the world**, the Tynwald, which dates back over 1,000 years.",
            "The native **Manx cat** is famous for being **tailless** due to a naturally occurring genetic mutation.",
            "A superstition holds that people must greet the **'little people' (fairies)** when crossing the **Fairy Bridge** to avoid bad luck.",
            "The island is renowned for the annual Tourist Trophy, one of the world's most famous and dangerous motorcycle races."
        ],
        "name": "Isle of Man"
    },
    "IN": {
        "facts": [
            "It is the **world's most populous country** and the largest democracy.",
            "The **Taj Mahal**, a massive white marble mausoleum, is one of the New Seven Wonders of the World.",
            "The country is the birthplace of four major religions: **Hinduism, Buddhism, Jainism, and Sikhism**.",
            "The **Ganges River** (Ganga) is considered a sacred river by Hindus."
        ],
        "name": "India"
    },
    "IO": {
        "facts": [
            "This overseas territory consists of the **Chagos Archipelago**, a group of seven atolls in the Indian Ocean.",
            "The largest and most strategically important island is **Diego Garcia**, which hosts a large military base operated by the United States and the United Kingdom.",
            "The entire territory is a vast **Marine Protected Area (MPA)**, the largest in the world when it was established in 2010.",
            "There is no permanent civilian population, as the original inhabitants (the Chagossians) were forcibly removed in the 1960s and 70s."
        ],
        "name": "British Indian Ocean Territory"
    },
    "IQ": {
        "facts": [
            "It is the heart of **Mesopotamia**, often called the 'cradle of civilization', where Sumerian, Akkadian, Assyrian, and Babylonian cultures flourished.",
            "The mighty **Tigris and Euphrates Rivers** flow through the entire country.",
            "The ruins of the ancient city of **Babylon** are located here.",
            "The major cities are primarily concentrated along the river valleys."
        ],
        "name": "Iraq"
    },
    "IR": {
        "facts": [
            "This ancient land was historically known as **Persia**.",
            "It is a country famous for producing the world's highest quality and largest quantity of **saffron**.",
            "The Persian New Year, **Nowruz**, is an ancient Zoroastrian festival marking the beginning of spring and is celebrated on the vernal equinox.",
            "The nation is bordered by the **Caspian Sea**, the world's largest inland lake or water body, to the north."
        ],
        "name": "Iran"
    },
    "IS": {
        "facts": [
            "It is known as the **'Land of Fire and Ice'** due to its combination of glaciers and active volcanoes.",
            "The parliament, **Alþingi**, established in 930 AD, is one of the world's oldest functioning legislative assemblies.",
            "The capital, **Reykjavík**, is the northernmost capital city in the world.",
            "It sits on the **Mid-Atlantic Ridge**, where the North American and Eurasian tectonic plates meet."
        ],
        "name": "Iceland"
    },
    "IT": {
        "facts": [
            "It has more **UNESCO World Heritage Sites** than any other country in the world (58 as of 2023).",
            "The capital, Rome, contains an independent country within its borders (Vatican City).",
            "It is the birthplace of pizza, with the first modern version being made in Naples in the late 19th century.",
            "The country's distinct **'boot shape'** is a famous geographic feature, with the island of Sicily often considered to be the 'ball' being kicked."
        ],
        "name": "Italy"
    },
    "JE": {
        "facts": [
            "This **Crown Dependency** is self-governing, though defense and international relations are managed by the UK.",
            "The island is famous for its local breed of **Jersey cattle**, known for producing rich milk.",
            "The local Norman language variant is known as **Jèrriais**.",
            "It is the largest of the **Channel Islands**."
        ],
        "name": "Jersey"
    },
    "JM": {
        "facts": [
            "The national flag is one of only two in the world that **doesn't contain the colors red, white, or blue**.",
            "The island is home to the **Homerus swallowtail**, one of the largest species of butterfly in the world.",
            "All of the **James Bond novels** were written on a coastal estate here by author Ian Fleming.",
            "The capital city, Kingston, has the **seventh-largest natural harbor** in the world."
        ],
        "name": "Jamaica"
    },
    "JO": {
        "facts": [
            "It is home to **Petra**, the ancient 'Rose City' carved into sandstone, which is one of the New Seven Wonders of the World.",
            "The country contains the **lowest point on Earth** on dry land, which is the surface of the **Dead Sea** (over 430 meters below sea level).",
            "**Wadi Rum**, known as the 'Valley of the Moon,' is a UNESCO World Heritage site and was the base of T.E. Lawrence ('Lawrence of Arabia') during the Arab Revolt.",
            "**Amman**, the capital, is one of the world's oldest continuously inhabited cities, with a history dating back to the Stone Age."
        ],
        "name": "Jordan"
    },
    "JP": {
        "facts": [
            "It is an archipelago of over 6,800 islands, with the four main islands being Honshu, Hokkaido, Kyushu, and Shikoku.",
            "The iconic peak of **Mount Fuji** is the country's highest mountain and a sacred site.",
            "It is the only country in the world that still has an **Emperor** as its head of state.",
            "The public transport system, particularly the **Shinkansen** (bullet train), is world-renowned for its speed and efficiency."
        ],
        "name": "Japan"
    },
    "KE": {
        "facts": [
            "The **Great Rift Valley**, a massive geographic trench, runs through the country.",
            "It is a world-renowned destination for **safaris**, particularly in the Maasai Mara National Reserve.",
            "The country's highest point, **Mount Kenya**, is the second-highest peak in Africa.",
            "The traditional foot-race of the **Maasai** people is a culturally significant event."
        ],
        "name": "Kenya"
    },
    "KG": {
        "facts": [
            "Over **90% of the country is mountainous**, dominated by the Tian Shan mountain range, making it a haven for trekkers and mountaineers.",
            "It is home to **Issyk-Kul Lake**, the world's second-largest high-altitude saline lake after the Caspian Sea.",
            "The **nomadic culture** is still very much alive, with many citizens living in traditional portable felt tents called **yurts** (Boz Üy) during the summer.",
            "Its national epic, the **Epic of Manas**, is an oral tradition with over 500,000 lines, making it one of the longest poems in the world."
        ],
        "name": "Kyrgyzstan"
    },
    "KH": {
        "facts": [
            "The national flag is the **only one in the world** to feature a building: the temple complex of **Angkor Wat**.",
            "The **Khmer language** does not use gender-specific pronouns for 'he' or 'she'.",
            "The Tonlé Sap is a unique freshwater lake and river system where the **river reverses its flow** seasonally.",
            "In this culture, the **head is considered the most sacred part of the body**, and touching someone's head is considered highly inappropriate."
        ],
        "name": "Cambodia"
    },
    "KI": {
        "facts": [
            "It is the only country in the world that straddles all **four hemispheres** (North, South, East, and West).",
            "The name is the local pronunciation of the English word **'Gilberts'** (Gilbert Islands), its former colonial name.",
            "The country's highest point is only about 81 meters (266 feet) above sea level, making it highly vulnerable to **climate change**.",
            "It moved the **International Date Line** eastward in 1994, making it the first to greet the new millennium."
        ],
        "name": "Kiribati"
    },
    "KM": {
        "facts": [
            "It is an archipelago nation known as the **'Perfume Islands'** because of its fragrant plants and essential oil production, particularly **ylang-ylang**.",
            "The largest island, Grande Comore, is home to **Mount Karthala**, one of the world's largest active shield volcanoes.",
            "The country has a history of political instability, reportedly experiencing over **20 coups or attempted coups** since gaining independence in 1975.",
            "Its flag features **four stars** representing its main islands and **four horizontal stripes** of green, white, red, and blue."
        ],
        "name": "Comoros"
    },
    "KN": {
        "facts": [
            "St. Kitts was the **first English colony in the Caribbean**, earning it the title 'The Mother Colony of the West Indies'.",
            "The country's flag is crossed by a black stripe, symbolizing its **African heritage**, with two white stars representing **hope and liberty**.",
            "The highest point is **Mount Liamuiga** (on St. Kitts), a dormant volcano with a crater lake.",
            "It is the **smallest sovereign state in the Americas** in both land area and population."
        ],
        "name": "Saint Kitts and Nevis"
    },
    "KP": {
        "facts": [
            "The national flag has a red star on a white disc, representing the **Juche** ideology, or 'self-reliance'.",
            "The **Rungrado May Day Stadium** in the capital is the world's largest stadium by seating capacity, reportedly holding over 114,000 spectators.",
            "The country uses a unique **Juche calendar**, which starts its years from the birth of its founder in 1912.",
            "The nation has a **command economy**, where the state controls all means of production and sets economic priorities."
        ],
        "name": "North Korea"
    },
    "KR": {
        "facts": [
            "It shares the most heavily fortified border in the world, the **Demilitarized Zone (DMZ)**, with its northern neighbor.",
            "The country is a global leader in technology and home to major brands like **Samsung and LG**.",
            "Its cultural wave, known as **'Hallyu'**, has propelled its K-Pop music and K-Dramas to global popularity.",
            "The capital, **Seoul**, operates one of the most efficient and extensive **subway systems** in the world."
        ],
        "name": "South Korea"
    },
    "KW": {
        "facts": [
            "It holds some of the world's largest **oil reserves**, making petroleum a dominant feature of its economy.",
            "The national symbols, the **Kuwait Towers**, are a group of three slender towers in the capital, used for water storage and a revolving restaurant.",
            "The currency, the **Kuwaiti Dinar (KWD)**, is consistently the highest-valued currency unit in the world.",
            "It is a constitutional emirate with a semi-democratic political system."
        ],
        "name": "Kuwait"
    },
    "KY": {
        "facts": [
            "This British Overseas Territory is a major **global financial hub** and a popular offshore banking destination.",
            "The islands are famously known as the home of the **Stingray City**, a series of shallow sandbars where visitors can interact with large Atlantic Southern Stingrays.",
            "It consists of three islands: Grand Cayman, Cayman Brac, and Little Cayman.",
            "The national bird is the **Grand Cayman Parrot**, a subspecies endemic to the island."
        ],
        "name": "Cayman Islands"
    },
    "KZ": {
        "facts": [
            "It is the **largest landlocked country in the world** by land area.",
            "The **Baikonur Cosmodrome**, the world's first and largest operational space launch facility, is located here and leased to Russia.",
            "The country's landscape is famous for its vast **steppes** (grasslands).",
            "The former capital, **Almaty**, is known for its dramatic mountain backdrop."
        ],
        "name": "Kazakhstan"
    },
    "LA": {
        "facts": [
            "It is the only landlocked country in Southeast Asia.",
            "It is the most **heavily bombed country** per capita in history, a legacy of the Vietnam War era.",
            "The national symbol is the **Pha That Luang**, a large, golden Buddhist stupa in the capital, Vientiane.",
            "The primary river is the **Mekong**, which serves as a major transportation route and a natural boundary in parts of the country."
        ],
        "name": "Laos"
    },
    "LB": {
        "facts": [
            "The national flag features a stylized **green cedar tree** in the center, symbolizing eternity and stability.",
            "The capital, **Beirut**, was once known as the 'Paris of the Middle East' due to its vibrant cultural life.",
            "The ancient Phoenician cities of **Byblos, Tyre, and Sidon** are located along its coast.",
            "The country has an unusual political system based on **confessionalism**, where major government positions are reserved for specific religious groups."
        ],
        "name": "Lebanon"
    },
    "LC": {
        "facts": [
            "It is the **only country in the world** named after a historical woman, **Saint Lucy of Syracuse**.",
            "The island's most famous landmarks are **The Pitons**, two volcanic spires (Gros Piton and Petit Piton) that are a UNESCO World Heritage Site.",
            "This country boasts the **world's only drive-in volcano**, the Sulphur Springs in Soufrière.",
            "The island changed hands between French and British control **14 times** before gaining independence, earning it the nickname 'Helen of the West Indies'."
        ],
        "name": "Saint Lucia"
    },
    "LI": {
        "facts": [
            "It is a **double landlocked country** (landlocked by countries that are themselves landlocked: Switzerland and Austria).",
            "The principality has a strong monarchy and is one of the world's **richest countries** by GDP per capita.",
            "The official language is German, and it is located entirely within the **Alps**.",
            "The national sport is **skiing**, and it has a strong tradition of winter sports success."
        ],
        "name": "Liechtenstein"
    },
    "LK": {
        "facts": [
            "It is often nicknamed the **'Pearl of the Indian Ocean'** due to its shape and natural beauty.",
            "The island is the world's largest exporter of **Ceylon tea**, which is a major part of its economy.",
            "The ancient rock fortress of **Sigiriya** (Lion Rock) is a prominent UNESCO World Heritage site.",
            "The country is famous for its colorful **Kandy Esala Perahera** festival, featuring decorated elephants and dancers."
        ],
        "name": "Sri Lanka"
    },
    "LR": {
        "facts": [
            "It was founded and colonized by **freed slaves** from the United States, giving the capital city its name: Monrovia, after U.S. President James Monroe.",
            "It was the first African republic to proclaim its independence (1847).",
            "The national flag is modeled after the U.S. flag, featuring a single star, earning it the nickname **'Lone Star'**.",
            "The official language is English, but numerous indigenous languages are also spoken."
        ],
        "name": "Liberia"
    },
    "LS": {
        "facts": [
            "This territory is an **enclaved country** completely surrounded by one single country, South Africa.",
            "It is nicknamed the 'Kingdom in the Sky' because it is the only country in the world to have **all of its land situated above 1,000 meters** (3,281 ft) in elevation.",
            "The traditional Basotho blanket is a crucial cultural garment worn as everyday attire.",
            "It holds the 'highest lowest point' of any country in the world, which is 1,400 meters above sea level."
        ],
        "name": "Lesotho"
    },
    "LT": {
        "facts": [
            "This country was the first country to declare independence from the Soviet Union in 1990.",
            "The language of this coutnry is one of the oldest surviving Indo-European languages, sharing ancient roots with Sanskrit.",
            "Basketball is often considered the national religion, with the national team being a source of great pride.",
            "It is a global leader in the production of scientific and industrial lasers."
        ],
        "name": "Lithuania"
    },
    "LU": {
        "facts": [
            "It is one of the **smallest countries** in Europe but one of the world's wealthiest by GDP per capita.",
            "It is one of the founding members of the European Union, NATO, and the UN.",
            "It has **three official languages**: Luxembourgish, French, and German.",
            "Public transport, including trains and buses, is **free** throughout the entire country."
        ],
        "name": "Luxembourg"
    },
    "LV": {
        "facts": [
            "The capital, **Rīga**, has one of the world's highest concentrations of **Art Nouveau** architecture.",
            "The people of this country are a 'singing nation,' with over **1.2 million recorded folk songs** and a massive Song and Dance Festival held every five years (a UNESCO heritage).",
            "It has one of the highest rates of women in scientific and technological fields in the EU.",
            "A tailor born in this country, Jacob Davis, helped pioneer the use of **rivets on denim trousers**, later partnering with Levi Strauss."
        ],
        "name": "Latvia"
    },
    "LY": {
        "facts": [
            "Over **90%** of the country is covered by the Sahara Desert, making its population heavily concentrated along the Mediterranean coast.",
            "The largest proven oil reserves in Africa are found here, making oil the cornerstone of the economy.",
            "The ancient Roman ruins of **Leptis Magna**, a major trading city, are one of its most important historical sites.",
            "The flag briefly used between 1977 and 2011 was solid green, making it the only national flag in the world at the time to be a single color with no design or insignia."
        ],
        "name": "Libya"
    },
    "MA": {
        "facts": [
            "It is the only African country that is not a member of the **African Union**, having withdrawn in 1984.",
            "The famous city of **Marrakesh** is nicknamed the 'Red City' because of the red walls of its *medina* (old city).",
            "The traditional marketplace, the **souk**, is a central feature of urban life, selling everything from spices to leather goods.",
            "The **Atlas Mountains** run through the interior, and it claims the territory of **Western Sahara**."
        ],
        "name": "Morocco"
    },
    "MC": {
        "facts": [
            "It is the **second smallest country** in the world, after Vatican City, and is famous for its high-end real estate.",
            "The annual **Formula 1 Grand Prix** is one of the most prestigious and challenging races in the world, often held on its city streets.",
            "The **Monte Carlo Casino** is a major landmark and a symbol of its glamour and wealth.",
            "The local population of citizens is often outnumbered by wealthy residents from other countries."
        ],
        "name": "Monaco"
    },
    "MD": {
        "facts": [
            "The country is home to **Mileștii Mici**, a wine cellar complex that holds the Guinness World Record for the **largest wine collection** by number of bottles (over 1.5 million).",
            "It is a **landlocked country** in Eastern Europe, situated between Romania and Ukraine.",
            "Its economy is heavily dependent on **agriculture**, particularly the production of wine, fruits, and vegetables.",
            "The capital, Chișinău, is characterized by its large expanses of green spaces, giving it the nickname **'the Green City'**."
        ],
        "name": "Moldova"
    },
    "ME": {
        "facts": [
            "The name literally means **'Black Mountain'**, referring to the dark, mountainous landscape of its interior.",
            "It is home to **Kotor Bay**, a dramatic fjord-like inlet on the Adriatic Sea, surrounded by steep limestone cliffs.",
            "The **Tara River Canyon**, located within its borders, is one of the deepest canyons in Europe.",
            "It was part of various federations with Serbia for nearly a century before declaring full independence in 2006."
        ],
        "name": "Montenegro"
    },
    "MF": {
        "facts": [
            "It shares an island with a French Collectivity of the same name and a Dutch constituent country (Sint Maarten).",
            "The island is famous for **Maho Beach**, where aircraft from the nearby Princess Juliana International Airport fly extremely low over sunbathers.",
            "The island has a thriving tourist economy due to its beautiful beaches and duty-free shopping.",
            "The border between the French and Dutch sides is one of the oldest in the world without fortifications."
        ],
        "name": "Saint Martin"
    },
    "MG": {
        "facts": [
            "It is the **fourth-largest island in the world**.",
            "About **90%** of its wildlife is endemic, including all species of **lemurs**.",
            "The impressive **Avenue of the Baobabs** is a major tourist landmark.",
            "The island broke away from the African mainland over 160 million years ago, leading to its unique biodiversity."
        ],
        "name": "Madagascar"
    },
    "MH": {
        "facts": [
            "This Pacific island nation is a major site of **US nuclear testing** between 1946 and 1958, particularly on Bikini and Enewetak Atolls.",
            "The islands have a unique history of navigation using **'stick charts'** (mattang), which represent wave patterns and swells.",
            "The country's average elevation is extremely low, making it one of the nations most vulnerable to **rising sea levels**.",
            "It is a sovereign state in free association with the United States."
        ],
        "name": "Marshall Islands"
    },
    "MK": {
        "facts": [
            "The name was officially changed in 2019 following the **Prespa Agreement** with Greece to resolve a long-standing naming dispute.",
            "It is a landlocked country in the Balkan Peninsula.",
            "The ancient city of **Ohrid** and its lake are a UNESCO World Heritage site, often considered one of the oldest and deepest lakes in Europe.",
            "The country's most famous historical figure is **Mother Teresa**, who was born in the capital, Skopje, when it was part of the Ottoman Empire."
        ],
        "name": "North Macedonia"
    },
    "ML": {
        "facts": [
            "It was once the heartland of three successive West African empires: the Ghana, Mali, and Songhai empires.",
            "The historic city of **Timbuktu** was a legendary trading post and a center of Islamic learning and ancient manuscripts.",
            "The **Niger River** flows through the country, providing a crucial source of water and transport.",
            "The **Great Mosque of Djenné** is the largest mud-brick building in the world and a UNESCO site."
        ],
        "name": "Mali"
    },
    "MM": {
        "facts": [
            "The former capital, Yangon, is home to the **Shwedagon Pagoda**, a massive, gold-plated stupa believed to contain relics of four Buddhas.",
            "The traditional calendar uses a system based on both the sun and the moon, with its New Year ('Thingyan') celebrated in mid-April with a massive water festival.",
            "The long-necked women of the **Kayan Lahwi** tribe are a famous cultural feature, where brass coils are worn around the neck.",
            "People traditionally chew **kun-ya** (betel quid), a stimulant made from betel nut, lime, and other ingredients, which stains the teeth and gums red."
        ],
        "name": "Myanmar"
    },
    "MN": {
        "facts": [
            "It is the **most sparsely populated sovereign country** in the world.",
            "The legendary conqueror **Genghis Khan** founded one of the largest continuous empires in history here.",
            "The traditional nomadic dwelling, the **'Ger'** (or *Yurt*), is still a common form of housing.",
            "The famous **Naadam Festival**, known as 'The Three Games of Men,' features archery, wrestling, and horse racing."
        ],
        "name": "Mongolia"
    },
    "MO": {
        "facts": [
            "It was a **Portuguese colony for over 400 years**, giving it a unique Luso-Chinese cultural mix.",
            "It is the **'Vegas of Asia'** and is the **world's largest gambling hub** by revenue.",
            "A famous tower here features one of the **world's highest commercial bungee jumps**.",
            "The Historic Centre of this country is a **UNESCO World Heritage site** with a blend of Chinese temples and Portuguese-style buildings."
        ],
        "name": "Macao (Macau)"
    },
    "MP": {
        "facts": [
            "It is a **Commonwealth in political union with the United States**; residents are U.S. citizens.",
            "The capital, **Saipan**, is geographically close to the **Mariana Trench**, the deepest point on Earth.",
            "The islands were the site of major battles during **World War II**, notably on Saipan and Tinian.",
            "The islands are known for their ancient **Latte stones**, which are large stone support pillars for traditional buildings."
        ],
        "name": "Northern Mariana Islands"
    },
    "MQ": {
        "facts": [
            "This overseas department of France is an island in the Caribbean known as the **'Isle of Flowers'**.",
            "The catastrophic eruption of **Mount Pelée** in 1902 destroyed the former capital, Saint-Pierre.",
            "It is the birthplace of the famous political theorist and writer **Frantz Fanon**.",
            "The traditional local rum, **Rhum Agricole**, is produced from sugarcane juice rather than molasses."
        ],
        "name": "Martinique"
    },
    "MR": {
        "facts": [
            "The vast majority of the population and the capital, **Nouakchott**, are situated on the Atlantic coast.",
            "It is home to the **Eye of the Sahara** (Richat Structure), a prominent circular geological feature in the desert.",
            "The country is crossed by the world's **longest train** (over 2.5 km long), which carries iron ore from the interior to the coast.",
            "The traditional culture is a blend of Arab and Berber influences."
        ],
        "name": "Mauritania"
    },
    "MS": {
        "facts": [
            "The island is nicknamed the **'Emerald Isle of the Caribbean'** due to its lush green landscape and historical ties to Irish settlers.",
            "It is the **only country outside of Ireland** where St. Patrick's Day is a public holiday, celebrating the anniversary of a failed slave revolt on that date.",
            "In 1995, the capital, **Plymouth**, was devastated and eventually buried by pyroclastic flows from the eruption of the **Soufrière Hills volcano**.",
            "This country is a **British Overseas Territory**, and its currency is the East Caribbean Dollar (XCD)."
        ],
        "name": "Montserrat"
    },
    "MT": {
        "facts": [
            "The **Ġgantija Temples** on Gozo island are older than both **Stonehenge and the Pyramids of Giza**.",
            "The **George Cross** medal for gallantry during a WWII siege is **embedded in the national flag**.",
            "The name of this country is thought to derive from the Greek word *meli*, meaning **'honey'**, due to its long history of beekeeping.",
            "Its capital, **Valletta**, is a UNESCO World Heritage site and one of the most concentrated historic areas in the world."
        ],
        "name": "Malta"
    },
    "MU": {
        "facts": [
            "The island nation is the only known habitat of the now-extinct **dodo bird**.",
            "It is known for the **'underwater waterfall'** illusion, a visual effect of sand being pushed off a shelf into the ocean depths.",
            "It is a highly diverse nation with a population made up of Indian, African, Chinese, and French ancestry.",
            "It has been called the **'star and key of the Indian Ocean'** for its strategic location."
        ],
        "name": "Mauritius"
    },
    "MV": {
        "facts": [
            "It is the **flattest country in the world**, with the lowest natural highest point of any country (2.4 meters/7 feet 10 inches).",
            "It is an archipelago of over 1,192 coral islands and atolls in the Indian Ocean.",
            "The economy is heavily reliant on **high-end tourism** and fishing.",
            "Its government famously held a **cabinet meeting underwater** in 2009 to draw attention to climate change and rising sea levels."
        ],
        "name": "Maldives"
    },
    "MW": {
        "facts": [
            "It is nicknamed **'The Warm Heart of Africa'** due to the friendliness of its people.",
            "A significant portion of its border is defined by **Lake Malawi** (also called Lake Nyasa), one of the African Great Lakes.",
            "The lake contains more **species of fish** than any other body of freshwater in the world.",
            "The capital was moved from Zomba to **Lilongwe** in 1975."
        ],
        "name": "Malawi"
    },
    "MX": {
        "facts": [
            "The **Great Pyramid of Cholula** in Puebla is the largest pyramid in the world by volume.",
            "The capital city is sinking by about **12 cm (5 inches) per year** because it was built over a former lakebed.",
            "The nation is home to the **Chicxulub Crater**, the impact site of the asteroid believed to have caused the extinction of the dinosaurs.",
            "It officially recognizes **68 indigenous languages** in addition to Spanish."
        ],
        "name": "Mexico"
    },
    "MY": {
        "facts": [
            "It is divided into two major landmasses: Peninsular Malaysia and East Malaysia (on the island of **Borneo**).",
            "The **Petronas Twin Towers** in the capital, Kuala Lumpur, were the tallest buildings in the world from 1998 to 2004.",
            "It is one of the world's most biodiverse countries, with extensive **rainforests** on Borneo.",
            "The official national animal is the **Malayan Tiger**."
        ],
        "name": "Malaysia"
    },
    "MZ": {
        "facts": [
            "The national flag features a **Kalashnikov AK-47 assault rifle** crossed with a hoe, symbolizing vigilance and agriculture.",
            "The country has an extensive coastline on the **Indian Ocean**, famous for its pristine beaches and coral reefs.",
            "The official language is **Portuguese**, a legacy of its colonial past.",
            "The **Limpopo River** flows through the southern part of the country before reaching the Indian Ocean."
        ],
        "name": "Mozambique"
    },
    "NA": {
        "facts": [
            "It is the **second least densely populated country** in the world, after Mongolia.",
            "It is home to the **Namib Desert**, the oldest desert in the world, with unique red sand dunes in the **Sossusvlei** region.",
            "The **Skeleton Coast** gets its name from the numerous shipwrecks and whale skeletons found along its foggy shores.",
            "The country has a significant German colonial architectural heritage."
        ],
        "name": "Namibia"
    },
    "NC": {
        "facts": [
            "It is a **French special collectivity** located in the Southwest Pacific Ocean, east of Australia.",
            "The territory is surrounded by a major barrier reef, the world's second-longest coral reef after the Australian Great Barrier Reef.",
            "This country holds approximately a quarter of the world's known **nickel resources**, making mining a vital part of its economy.",
            "The capital, **Nouméa**, is sometimes referred to as the 'Paris of the Pacific' due to its French influence and architecture."
        ],
        "name": "New Caledonia"
    },
    "NE": {
        "facts": [
            "Over **80% of its land area is covered by the Sahara Desert**.",
            "The country is named after the **Niger River**, which flows through its southwestern part and is vital for agriculture.",
            "The capital, **Niamey**, is the country's main administrative and economic center.",
            "The country has one of the **highest fertility rates** in the world."
        ],
        "name": "Niger"
    },
    "NF": {
        "facts": [
            "This small island territory of Australia was once a penal colony, and its capital, **Kingston**, is a UNESCO World Heritage site.",
            "The **Norfolk Island pine** tree, which is featured on the territory's flag, is endemic and a major symbol.",
            "Many of the current residents are descendants of the **Bounty mutineers** and their Tahitian companions, who settled here from Pitcairn Island.",
            "The local language is a mix of 18th-century English and Tahitian."
        ],
        "name": "Norfolk Island"
    },
    "NG": {
        "facts": [
            "It is the **most populous country in Africa** and the continent's largest economy.",
            "The film industry, known as **'Nollywood'**, is one of the world's largest in terms of film output.",
            "It is home to over **500 indigenous languages** and over 250 ethnic groups, making it immensely culturally diverse.",
            "The **Kofar Mata Dye Pits** in Kano are considered the oldest in Africa, dating back to 1498."
        ],
        "name": "Nigeria"
    },
    "NI": {
        "facts": [
            "The large **Lake Nicaragua** (Cocibolca) is the largest lake in Central America and is unique for containing oceanic fish, including sharks.",
            "The country is known for its many active **volcanoes**, which are popular for activities like volcano boarding.",
            "The port city of **Granada** is famous for its well-preserved Spanish colonial architecture.",
            "The national symbol is the **Guardabarranco** (Turquoise-browed motmot), a brightly colored tropical bird."
        ],
        "name": "Nicaragua"
    },
    "NL": {
        "facts": [
            "A significant portion of the land, about **26%**, is below sea level, protected by dikes and polders.",
            "The country is famous for its historic **windmills**, originally used for drainage and milling grain.",
            "The official capital is Amsterdam, but the seat of government, the parliament, and the Supreme Court are located in **The Hague**.",
            "It is the world's largest exporter of **tulips** and tulip bulbs, even though the flower is not native to the area."
        ],
        "name": "Netherlands"
    },
    "NO": {
        "facts": [
            "The country is famous for its dramatic coastal inlets called **fjords**, carved by ancient glaciers.",
            "It is the world leader in the adoption of **electric vehicles** per capita.",
            "The country's vast wealth comes largely from its large **offshore oil and gas reserves**.",
            "In the northern regions, the **Northern Lights (Aurora Borealis)** are a frequent spectacle."
        ],
        "name": "Norway"
    },
    "NP": {
        "facts": [
            "It is home to **Mount Everest** (Sagarmatha), the world's highest peak, and eight of the world's ten highest mountains.",
            "Its national flag is the **only one in the world** that is not rectangular or square; it is two overlapping triangles.",
            "It is the birthplace of **Siddhartha Gautama (Buddha)**, in the town of Lumbini.",
            "The country is famous for the brave **Gurkha soldiers** who serve in foreign armies."
        ],
        "name": "Nepal"
    },
    "NR": {
        "facts": [
            "This is the **world's smallest island country** by area and the smallest republic.",
            "It is the **only country in the world without an official capital city**; government offices are located in the Yaren District.",
            "A history of intense **phosphate mining** resulted in environmental devastation, leaving much of the island's interior barren.",
            "The country has no protected natural inland bodies of water, with freshwater primarily supplied by **rainwater collection and desalination**."
        ],
        "name": "Nauru"
    },
    "NU": {
        "facts": [
            "It is an island nation known as the **'Rock of Polynesia'** and is one of the world's largest coral islands.",
            "There are more people who come from this country living outside of this country (like New Zealand), than on the island itself.",
            "The island was, for a short time, the only country in the world to have **Pokémon characters on its legal tender currency**.",
            "The entire island nation is covered by a single-island-wide **Wi-Fi internet network**."
        ],
        "name": "Niue"
    },
    "NZ": {
        "facts": [
            "It consists of two main landmasses, the **North and South Islands**, and numerous smaller islands.",
            "The indigenous people, the **Māori**, perform the **'Haka'** war dance, famously adopted by the national rugby team.",
            "The stunning landscapes were the primary filming location for the **'Lord of the Rings'** and 'The Hobbit' trilogies.",
            "The national bird, the **Kiwi**, is a nocturnal, flightless bird and a national symbol."
        ],
        "name": "New Zealand"
    },
    "OM": {
        "facts": [
            "The capital, **Muscat**, is framed by rugged mountains and the Arabian Sea.",
            "The country has an ancient history of **maritime trade**, particularly in frankincense and spices.",
            "It is the oldest independent state in the Arab world.",
            "The country is governed by a **Sultan** and is known for its relatively stable political environment."
        ],
        "name": "Oman"
    },
    "PA": {
        "facts": [
            "It is home to the famous **Panama Canal**, an artificial waterway connecting the Atlantic and Pacific oceans, fundamentally changing global shipping.",
            "The country is the only place in the world where you can see the **sun rise over the Pacific and set over the Atlantic** from the highest points.",
            "The traditional native textile art, the **Mola**, is made by the Kuna people.",
            "The country's currency, the **Balboa**, is pegged to the US dollar, which is used as legal tender."
        ],
        "name": "Panama"
    },
    "PE": {
        "facts": [
            "It is the heartland of the ancient **Inca Empire**, with the famous citadel of **Machu Picchu** being its most recognizable site.",
            "The **Andes Mountains** run the length of the country, creating a diverse geography that includes a coastal desert, highlands, and Amazon rainforest.",
            "It is the country with the largest number of **native potato varieties** in the world, with thousands recorded.",
            "The national drink is the **Pisco Sour**, a cocktail made with Pisco brandy, lime juice, egg white, and bitters."
        ],
        "name": "Peru"
    },
    "PF": {
        "facts": [
            "This overseas collectivity of France includes the famous island of **Tahiti**, which is home to the capital, Papeete.",
            "The islands are known for cultivating and exporting high-quality **black pearls**.",
            "It was a major site for **French nuclear testing** between 1966 and 1996.",
            "The islands feature dramatic volcanic peaks and surrounding turquoise lagoons and coral reefs."
        ],
        "name": "French Polynesia"
    },
    "PG": {
        "facts": [
            "It is considered one of the most **culturally diverse** countries on Earth, with over 850 indigenous languages.",
            "The traditional currency in some areas, the **Kina**, is named after a pearl shell used historically for trading.",
            "It occupies the eastern half of the island of **New Guinea** and numerous offshore islands.",
            "The beautiful and diverse **Birds of Paradise** are a national symbol."
        ],
        "name": "Papua New Guinea"
    },
    "PH": {
        "facts": [
            "This country is an archipelago of over **7,640 islands**, making it the second-largest archipelago nation in the world.",
            "It is the **only Christian-majority nation in Asia**, with approximately 85% of the population being Catholic.",
            "The country is part of the **Pacific Ring of Fire**, resulting in frequent earthquakes and a high concentration of volcanoes.",
            "The local **Jeepney** is the most popular form of public transportation, originating from surplus U.S. military jeeps left after World War II."
        ],
        "name": "Philippines"
    },
    "PK": {
        "facts": [
            "It is home to **K2 (Mount Godwin Austen)**, the second-highest mountain in the world.",
            "The historical **Indus Valley Civilization**, one of the world's oldest, flourished here.",
            "The capital, **Islamabad**, is a modern, planned city, built in the 1960s to replace Karachi.",
            "The country's national language, **Urdu**, is written using a modified Perso-Arabic script."
        ],
        "name": "Pakistan"
    },
    "PL": {
        "facts": [
            "The historic city of **Kraków** was the royal capital for centuries and is famous for its Wawel Castle.",
            "The country is the birthplace of the astronomer **Nicolaus Copernicus**, who proposed the heliocentric model of the universe.",
            "The city of **Wrocław** has an unusual number of small dwarf statues scattered throughout the city.",
            "It is often considered the geographical center of Europe."
        ],
        "name": "Poland"
    },
    "PM": {
        "facts": [
            "It is the **only remaining overseas collectivity of France** in North America, located just south of Newfoundland, Canada.",
            "The residents speak **French**, and the island's culture is a blend of French and North American influences.",
            "The archipelago is famous for its **colorful wooden houses**, a tradition dating back to the 1950s.",
            "You can often spot **seals, dolphins, and even whales** in the surrounding marine environment."
        ],
        "name": "Saint Pierre and Miquelon"
    },
    "PN": {
        "facts": [
            "It is one of the **least populated territories in the world**, with fewer than 50 residents.",
            "The population consists almost entirely of the **descendants of the *HMS Bounty* mutineers** and the Tahitian women who accompanied them.",
            "The inhabitants speak a unique creole language called **Pitkern**, which blends 18th-century English with Tahitian.",
            "The island produces what is often regarded as some of the **purest honey in the world** due to the island's isolation and lack of pollution."
        ],
        "name": "Pitcairn Islands"
    },
    "PR": {
        "facts": [
            "This unincorporated territory of the United States has its own Olympic team.",
            "The most famous frog species, the **'Coquí'**, is a major cultural symbol known for its distinct two-note call.",
            "The historic fortress of **El Morro** (Castillo San Felipe del Morro) in San Juan is a popular landmark.",
            "The island has several bays that exhibit **bioluminescent waters** at night."
        ],
        "name": "Puerto Rico"
    },
    "PS": {
        "facts": [
            "The region is often called the **Holy Land**, as it is sacred to the three major Abrahamic religions: **Judaism, Christianity, and Islam**.",
            "Ancient **Jericho**, located in the West Bank, is considered one of the **oldest continuously inhabited cities** in the world.",
            "The city of **Bethlehem**, in the West Bank, is revered by Christians as the **birthplace of Jesus**."
        ],
        "name": "Palestine"
    },
    "PT": {
        "facts": [
            "It is the **oldest nation-state** on the Iberian Peninsula and one of the oldest in Europe, with its borders largely unchanged since 1297.",
            "It was a major naval power during the **Age of Exploration**, establishing a vast global empire.",
            "The haunting and expressive music genre known as **'Fado'** is recognized as a UNESCO Intangible Cultural Heritage of Humanity.",
            "The city of Lisbon is famous for its historic **tram network**, especially the iconic Tram 28."
        ],
        "name": "Portugal"
    },
    "PW": {
        "facts": [
            "This country is an **archipelago of over 340 islands** in the western Pacific Ocean, with only about eight of them permanently inhabited.",
            "The country is home to the famous **Jellyfish Lake**, a marine lake where millions of golden jellyfish migrate daily, though the population fluctuates.",
            "It was the first country in the world to create a **shark sanctuary** in its exclusive economic zone, banning all commercial shark fishing in its waters.",
            "The culture of this country is traditionally **matrilineal**, where land and wealth are passed down through the female line."
        ],
        "name": "Palau"
    },
    "PY": {
        "facts": [
            "It is one of only two landlocked countries in South America (the other being Bolivia).",
            "The **Guaraní language** is widely spoken and is an official language alongside Spanish.",
            "The **Itaipu Dam** on the Paraná River, shared with Brazil, was once the world's largest operational hydroelectric power plant by annual energy generation.",
            "It had one of the deadliest conflicts in South American history, the **War of the Triple Alliance** (1864–1870), which devastated the country's population."
        ],
        "name": "Paraguay"
    },
    "QA": {
        "facts": [
            "It is one of the **most urbanized countries in the world**, with nearly all residents living in a city.",
            "It is the **richest country in the world** by GDP per capita.",
            "The country has a long tradition of **camel racing**, which now famously uses **robot jockeys**.",
            "Its flag's distinctive **maroon color and nine-pointed serrated edge** symbolize the nation as the ninth member of the 'reconciled emirates' of the Persian Gulf."
        ],
        "name": "Qatar"
    },
    "RE": {
        "facts": [
            "This French overseas department is located in the Indian Ocean, east of Madagascar.",
            "It is home to **Piton de la Fournaise**, one of the world's most active volcanoes.",
            "It has a diverse culture that blends European, African, and Asian influences, particularly in its Creole cuisine and music.",
            "Sugarcane cultivation is a major industry, covering a significant part of the available arable land."
        ],
        "name": "Réunion"
    },
    "RO": {
        "facts": [
            "The region of **Transylvania** is famously associated with the legend of Dracula and the historical figure Vlad the Impaler.",
            "The country's parliament building in the capital, Bucharest, is one of the **largest and heaviest buildings** in the world.",
            "The Carpathian Mountains form a large, curving arc through the center of the country.",
            "The language is a **Romance language**, derived from Latin, unlike most of its Slavic-speaking neighbors."
        ],
        "name": "Romania"
    },
    "RS": {
        "facts": [
            "The capital, **Belgrade**, is one of the oldest cities in Europe, situated at the confluence of the Sava and Danube Rivers.",
            "It has produced numerous world-class athletes, particularly in **tennis**.",
            "The country has a strong tradition of **Orthodox Christianity** and is home to many medieval monasteries.",
            "The local fruit brandy, **Šljivovica** (plum brandy), is a popular national drink."
        ],
        "name": "Serbia"
    },
    "RU": {
        "facts": [
            "It is the **largest country in the world** by area, covering over 17 million square kilometers and spanning 11 time zones.",
            "The nation is home to **Lake Baikal**, the world's largest freshwater lake by volume, containing over 20% of the world's unfrozen surface fresh water.",
            "The **Trans-Siberian Railway** is the longest railway line in the world, stretching over 9,289 kilometers from the capital to the Pacific coast.",
            "Vast tracts of forests, primarily in Siberia, make this nation hold the largest forest area globally."
        ],
        "name": "Russia"
    },
    "RW": {
        "facts": [
            "It is known as the **'Land of a Thousand Hills'** (**Igihugu cy'Imisozi Igihumbi**) due to its mountainous geography.",
            "The country is globally famous for the critically endangered **mountain gorillas**, which live in the Volcanoes National Park.",
            "The government mandates a monthly national community service day called **Umuganda**, where all citizens participate in public works like cleaning streets and building schools.",
            "The national Parliament consistently has one of the **highest percentages of female members** in the world."
        ],
        "name": "Rwanda"
    },
    "SA": {
        "facts": [
            "This nation is the birthplace of Islam and home to the two holiest sites: **Mecca** and **Medina**.",
            "It contains the world's **largest continuous sand desert**, the Rub' al Khali (Empty Quarter).",
            "It is one of the very few countries in the world with **no permanent rivers**.",
            "The territory is the **world's largest exporter of petroleum** and holds the world's second-largest proven oil reserves."
        ],
        "name": "Saudi Arabia"
    },
    "SB": {
        "facts": [
            "The islands were a major battleground in the Pacific Theater during **World War II**, with many historical wrecks accessible to divers.",
            "About 5-10% of the indigenous population has a unique genetic trait resulting in **naturally occurring blonde hair**, without European heritage.",
            "**Kavachi**, one of the world's most active underwater volcanoes, is part of the territory, with researchers discovering **sharks living inside its crater**.",
            "The country is an archipelago of nearly **1,000 islands** and is known for having one of the most diverse populations in the South Pacific."
        ],
        "name": "Solomon Islands"
    },
    "SC": {
        "facts": [
            "This archipelago consists of **115 islands** in the Indian Ocean, mostly uninhabited.",
            "It is home to the rare **Coco de Mer** palm, which produces the largest seed in the plant kingdom.",
            "The nation has one of the highest **GDPs per capita** in Africa, largely due to its tourism and fishing industries.",
            "The capital, **Victoria**, is one of the smallest capital cities in the world."
        ],
        "name": "Seychelles"
    },
    "SD": {
        "facts": [
            "The capital, Khartoum, is the site of the **confluence of the Blue Nile and White Nile** to form the great Nile River.",
            "It contains a remarkable number of **ancient pyramids** (especially at Meroë) built by the rulers of the Kingdom of Kush, often exceeding the number found in Egypt.",
            "It is the **third-largest country in Africa** by area.",
            "This country's cuisine features staples like **Aseeda** (a porridge) and **Gorrassa** (a sourdough flatbread)."
        ],
        "name": "Sudan"
    },
    "SE": {
        "facts": [
            "It is the birthplace of the **Nobel Prize**, established by Alfred Nobel, with the awards ceremony held annually in Stockholm.",
            "The country has the most **islands** of any country, with an estimated count of over 221,800.",
            "The concept of **'Fika'** (a break for coffee and a pastry) is a major part of its social culture.",
            "The traditional architecture in the countryside often features distinctive **red wooden houses**."
        ],
        "name": "Sweden"
    },
    "SG": {
        "facts": [
            "It is a **city-state** and one of the world's few remaining sovereign island city-states.",
            "The country has a strict policy on cleanliness and famously **banned chewing gum** sales.",
            "It is one of the **busiest ports** in the world, a crucial hub for global trade.",
            "The national symbol is the **Merlion**, a mythical creature with a lion's head and a fish's body."
        ],
        "name": "Singapore"
    },
    "SH": {
        "facts": [
            "This country is famous as the place of **Napoleon Bonaparte's final exile and death**.",
            "**Tristan da Cunha** is cited as the **most remote inhabited archipelago in the world**.",
            "All three islands are **volcanic** and extremely isolated in the South Atlantic Ocean.",
            "Ascension Island is a critical nesting ground for the **green turtle**."
        ],
        "name": "Saint Helena, Ascension and Tristan da Cunha"
    },
    "SI": {
        "facts": [
            "It is considered one of the **most forested countries** in Europe, with over 60% of its land covered by trees.",
            "The capital, **Ljubljana**, is known for its Dragon Bridge and Baroque architecture.",
            "It is the only country in Europe that combines the **Alps, the Mediterranean, the Pannonian Plain, and the Karst**.",
            "The world-famous **Lipizzaner horses** have their origins in the village of Lipica here."
        ],
        "name": "Slovenia"
    },
    "SJ": {
        "facts": [
            "This archipelago is part of Norway but operates under a special international treaty, allowing citizens of signatory countries to reside there.",
            "The main island, Svalbard, is famous for its requirement that residents carry **rifles for protection against polar bears**.",
            "The **Global Seed Vault**, a secure seed bank designed to store duplicates of seeds from genebanks worldwide, is located here.",
            "During the summer, the islands experience **midnight sun**; in winter, they have a polar night."
        ],
        "name": "Svalbard and Jan Mayen"
    },
    "SK": {
        "facts": [
            "The country has an extraordinarily high number of **castles and chateaux** per capita, with hundreds scattered across the landscape.",
            "It became an independent country in 1993 after the peaceful dissolution of **Czechoslovakia**.",
            "The capital, **Bratislava**, is the only capital city in the world that borders two other countries (Austria and Hungary).",
            "The traditional national dish is **Bryndzové halušky**, which consists of small potato dumplings mixed with soft sheep cheese and usually topped with fried bacon."
        ],
        "name": "Slovakia"
    },
    "SL": {
        "facts": [
            "The capital, **Freetown**, was founded in 1792 as a settlement for **freed slaves** arriving from the Americas and Great Britain.",
            "The country's name, given by Portuguese explorer Pedro de Sintra, means **'Lion Mountains'**.",
            "It is a major global producer of **titanium and bauxite**, and is historically known for its diamond mining.",
            "The most widely spoken language across the country is **Krio**, an English-based creole."
        ],
        "name": "Sierra Leone"
    },
    "SM": {
        "facts": [
            "It is often cited as the **oldest surviving sovereign state and constitutional republic in the world**, founded in 301 AD.",
            "It is a **landlocked enclave completely surrounded by Italy** (one of only three countries in the world to be a complete enclave).",
            "Its constitution, the *Leges Statutae Republicae Sancti Marini*, is the **oldest continually active written constitution**.",
            "The capital is located atop **Mount Titano**, which features three famous defensive towers."
        ],
        "name": "San Marino"
    },
    "SN": {
        "facts": [
            "The capital, **Dakar**, is the westernmost city on the African mainland, situated on the Cap-Vert peninsula.",
            "The most popular spectator sport is traditional wrestling (Laamb), where matches can draw huge crowds and are often accompanied by mystical rituals.",
            "It is known for the **Lac Rose (Pink Lake)**, which gets its distinctive color from *Dunaliella salina* algae in its high-salt water.",
            "The country has a long tradition of **'Teranga,'** which means hospitality, often considered a pillar of the national identity."
        ],
        "name": "Senegal"
    },
    "SO": {
        "facts": [
            "This nation possesses the **longest coastline** of any country in mainland Africa.",
            "The land is historically famous for being a major producer and exporter of **frankincense**.",
            "A critically endangered species, the **Somali Wild Ass**, is one of the few places in the world where it is natively found.",
            "The culture has a rich **oral tradition** of poetry and storytelling, which is the primary means of passing down history and knowledge."
        ],
        "name": "Somalia"
    },
    "SR": {
        "facts": [
            "It is the **smallest sovereign country** in South America by area and population.",
            "It is one of the few places outside of Asia where **Dutch** is the official language, a legacy of its colonial past.",
            "The capital, **Paramaribo**, features a historic inner city that is a UNESCO World Heritage site due to its unique wooden architecture.",
            "Over 90% of the land is covered by **rainforest**, making it one of the most forested countries in the world."
        ],
        "name": "Suriname"
    },
    "SS": {
        "facts": [
            "It is the **world's youngest country**, having gained independence from Sudan in July 2011.",
            "The primary economic activity is **oil production**, which accounts for most of its exports and government revenue.",
            "The **White Nile River** flows through the heart of the country.",
            "Vast areas of the country are covered by the **Sudd**, one of the world's largest wetlands."
        ],
        "name": "South Sudan"
    },
    "ST": {
        "facts": [
            "This small nation is Africa's **second-smallest country** by population and consists of two main islands and several islets.",
            "It was a major global center for **cocoa production** in the early 20th century, earning it the nickname 'Chocolate Islands'.",
            "It is a Portuguese-speaking country, having been a former colony of Portugal.",
            "The dramatic, needle-shaped volcanic peak called **Pico Cão Grande** is a prominent natural landmark."
        ],
        "name": "São Tomé and Príncipe"
    },
    "SV": {
        "facts": [
            "It is nicknamed the **'Land of Volcanoes'** due to its high concentration of volcanoes (over 20 potentially active).",
            "It is the **smallest** country in Central America by area and the only one without a Caribbean coastline.",
            "The official currency is the **US Dollar**, adopted in 2001.",
            "The **torogoz** (Turquoise-browed Motmot), the national bird, symbolizes liberty and unity because it does not adapt well to captivity."
        ],
        "name": "El Salvador"
    },
    "SX": {
        "facts": [
            "It is a constituent country of the Kingdom of the Netherlands and shares an island with a French collectivity (Saint Martin).",
            "The famous **Maho Beach** is located here, where commercial jets land extremely low over the sand.",
            "The economy is heavily focused on **tourism**, especially duty-free shopping and casinos.",
            "The capital, **Philipsburg**, is known for its narrow strip of land between the sea and a salt pond."
        ],
        "name": "Sint Maarten"
    },
    "SY": {
        "facts": [
            "The capital, **Damascus**, is widely considered to be one of the oldest continuously inhabited cities in the world.",
            "The country's history dates back to the very dawn of civilization, having been home to the ancient **Ebla** kingdom.",
            "It is located in the **Fertile Crescent**, a region often called the 'cradle of civilization'.",
            "The ancient desert city of **Palmyra**, famous for its Greco-Roman ruins, is a major historical site."
        ],
        "name": "Syria"
    },
    "SZ": {
        "facts": [
            "Formerly known as Swaziland, this is one of the world's **last remaining absolute monarchies**.",
            "It is a **landlocked country** bordered by Mozambique and South Africa.",
            "The territory hosts the **Umhlanga (Reed Dance)**, an annual, traditional ceremony that involves thousands of unmarried women.",
            "It has **two capital cities**: Mbabane (administrative) and Lobamba (legislative and royal)."
        ],
        "name": "Eswatini"
    },
    "TC": {
        "facts": [
            "The nation is a **British Overseas Territory** but uses the **US Dollar** as its official currency.",
            "A significant local treasure is **JoJo**, a wild Atlantic bottlenose dolphin who has interacted with humans in the surrounding waters for decades.",
            "The islands have **no permanent rivers or lakes**, depending entirely on desalination and rainfall for freshwater.",
            "The territory's flag features a yellow shield displaying a conch shell, a lobster, and a native cactus."
        ],
        "name": "Turks and Caicos Islands"
    },
    "TD": {
        "facts": [
            "It is the **largest landlocked country in Africa** by land area.",
            "The country's name is derived from a large, shallow lake, a large, shallow lake that has shrunk drastically due to climate change and water diversion.",
            "Due to low light pollution from industry and cities, the country's rural areas are known for having a spectacularly clear **night sky**.",
            "The official languages are **French and Arabic**."
        ],
        "name": "Chad"
    },
    "TF": {
        "facts": [
            "This overseas territory of France is a collection of volcanic islands in the sub-Antarctic Indian Ocean and a claim on Antarctica.",
            "It is home to the active volcano **Mont Ross**, the highest point in the territory.",
            "The islands are permanently inhabited only by **scientific researchers and military personnel**.",
            "The territory is a vast nature reserve, famous for its large populations of penguins and seals."
        ],
        "name": "French Southern and Antarctic Lands"
    },
    "TG": {
        "facts": [
            "The **Akodessewa Fetish Market** in the capital, Lomé, is one of the **largest voodoo markets** in West Africa, selling traditional medicinal and ritual objects.",
            "The Tamberma people in the north are known for their unique **two-story fortified mud-brick houses** called **Takienta**, which are a UNESCO World Heritage site.",
            "It has a **short coastline** (about 56 km or 35 miles) along the Gulf of Guinea.",
            "The nation's football (soccer) team is nicknamed the **'Sparrowhawks'** (Les Éperviers)."
        ],
        "name": "Togo"
    },
    "TH": {
        "facts": [
            "It is the only Southeast Asian country that was **never colonized** by a European power.",
            "The traditional greeting, the **'Wai'**, involves a slight bow with the palms pressed together.",
            "The capital, **Bangkok**, has the longest name of any city in the world (though few use the full name).",
            "The country is known as the **'Land of Smiles'**."
        ],
        "name": "Thailand"
    },
    "TJ": {
        "facts": [
            "It is a **landlocked country** in Central Asia, bordered by Afghanistan, China, Kyrgyzstan, and Uzbekistan.",
            "Over **90% of the country is mountainous**, dominated by the Pamir Mountains, often called the 'Roof of the World'.",
            "The **Pamir Highway** is one of the world's most spectacular and highest-altitude roads.",
            "It is home to the **Fedchenko Glacier**, one of the longest glaciers outside the polar regions."
        ],
        "name": "Tajikistan"
    },
    "TK": {
        "facts": [
            "This territory of New Zealand consists of three tropical coral **atolls** in the South Pacific.",
            "It is the first territory in the world to be **100% solar powered** for its electricity needs.",
            "There are no airfields; the islands are only accessible by **boat** from Samoa.",
            "The traditional form of government is a council of elders (*Taupulega*)."
        ],
        "name": "Tokelau"
    },
    "TL": {
        "facts": [
            "It is one of the **youngest countries in the world**, gaining full independence in 2002.",
            "The country is sharing a land border with Indonesia.",
            "It is the only country in Asia where **Portuguese is an official language** (along with Tetum).",
            "The capital, **Dili**, is dominated by a large statue of **Cristo Rei** (Christ the King), a gift from Indonesia."
        ],
        "name": "Timor-Leste"
    },
    "TM": {
        "facts": [
            "This country is officially recognized by the United Nations as a **permanently neutral state** since 1995.",
            "It is home to the **'Gate to Hell'** or Darvaza gas crater, a massive natural gas field that has been burning continuously since at least 1971.",
            "The capital city, **Ashgabat**, holds multiple Guinness World Records, including the world's highest concentration of buildings faced with **white marble**.",
            "The country has the world's only flag that features a piece of textile art: a vertical red stripe containing **five ornamental carpet guls** (designs)."
        ],
        "name": "Turkmenistan"
    },
    "TN": {
        "facts": [
            "The country is home to the ancient city of **Carthage**, a major power in the Mediterranean until its defeat by Rome.",
            "It was the **birthplace of the 'Arab Spring'** movement in 2010-2011.",
            "The A major desert here was a primary filming location for the planet **Tatooine** in the original **Star Wars** saga.",
            "The ancient Roman amphitheater of **El Jem** is one of the best-preserved in the world, rivaling the Colosseum."
        ],
        "name": "Tunisia"
    },
    "TO": {
        "facts": [
            "It is the **only monarchy in the Pacific** that has never been formally colonized by a foreign power.",
            "It's nicknamed the **'Friendly Islands'**, a name given by Captain James Cook, though he was unaware the locals were planning to attack him.",
            "The national rugby team performs a traditional war dance called the **'Sipi Tau'** before matches.",
            "This country is the **first place on Earth** to see the sunrise each new day during the Southern Hemisphere summer."
        ],
        "name": "Tonga"
    },
    "TR": {
        "facts": [
            "The largest city, **Istanbul**, is unique in that it straddles two continents, **Europe and Asia**.",
            "The ancient city of **Troy**, famous from Greek mythology, is located on its Aegean coast.",
            "The popular dish **Döner Kebab** is a major culinary export.",
            "The country's distinctive, swirling **'Whirling Dervishes'** are a mystical Sufi order."
        ],
        "name": "Turkey"
    },
    "TT": {
        "facts": [
            "The two islands are the birthplace of the **Steelpan** (or steel drum), the only acoustic instrument invented in the 20th century.",
            "It is famous for the annual **Carnival**, a massive pre-Lenten celebration of music, costume, and dance.",
            "The island of Trinidad has the world's largest natural reservoir of **asphalt** (Pitch Lake).",
            "The vibrant music style **Calypso** originated here."
        ],
        "name": "Trinidad and Tobago"
    },
    "TV": {
        "facts": [
            "It is an extremely low-lying Pacific island nation, making it one of the most threatened by **rising sea levels**.",
            "The country earns significant revenue from licensing its **'.tv' internet domain extension**.",
            "The highest elevation is only about 4.6 meters (15 feet) above sea level.",
            "It is one of the smallest countries in the world by both area and population."
        ],
        "name": "Tuvalu"
    },
    "TW": {
        "facts": [
            "It operates as a democratic, self-ruled state, though it is claimed by the People's Republic of China.",
            "The former world's tallest building, **Taipei 101**, is known for its massive tuned mass damper designed to withstand typhoons and earthquakes.",
            "It is one of the world leaders in the production of **computer hardware and semiconductors**.",
            "The local cuisine is famous for its **night markets** and street food culture."
        ],
        "name": "Taiwan"
    },
    "TZ": {
        "facts": [
            "It is home to **Mount Kilimanjaro**, the highest mountain in Africa and the highest single freestanding mountain in the world.",
            "It contains most of the **Serengeti National Park**, famous for the annual **Great Migration** of wildebeest and zebras.",
            "The island of **Zanzibar** is part of this country and is famous for its history as a major trading hub and the birthplace of Queen frontman **Freddie Mercury**.",
            "**Lake Tanganyika**, which forms part of its border, is the world's longest freshwater lake and the second-deepest."
        ],
        "name": "Tanzania"
    },
    "UA": {
        "facts": [
            "It is the **largest country entirely within Europe** by area.",
            "The capital, **Kyiv**, is known for the **Kyiv Pechersk Lavra** (Monastery of the Caves), a major Eastern Orthodox Christian site.",
            "It is one of the world's largest exporters of **grain**, earning it the nickname the 'Breadbasket of Europe'.",
            "The world's deepest metro station, **Arsenalna Station**, is located in its capital."
        ],
        "name": "Ukraine"
    },
    "UG": {
        "facts": [
            "It contains a major portion of **Lake Victoria**, the largest lake in Africa and the source of the Nile River.",
            "The endangered **mountain gorillas** are a major draw for tourism in the Bwindi Impenetrable National Park.",
            "The **Equator** passes directly through the country, with markers on the road for photo opportunities.",
            "The local currency is the **Ugandan Shilling**."
        ],
        "name": "Uganda"
    },
    "UM": {
        "facts": [
            "This is a statistical designation for **nine uninhabited territories** of the United States in the Pacific and Caribbean.",
            "The territories include **Midway Atoll** and **Wake Island**, which were key sites during World War II.",
            "They are administered by the Department of the Interior and primarily serve as **wildlife refuges**.",
            "The islands are generally remote and have no permanent resident population."
        ],
        "name": "United States Minor Outlying Islands"
    },
    "US": {
        "facts": [
            "It is the **only country to have all five major climate zones** (tropical, dry, temperate, continental, and polar).",
            "The country has **no official language** at the federal level, though English is the de facto national language.",
            "Alaska is the **largest state** (more than twice the size of Texas) and was purchased from the Russian Empire in 1867.",
            "The **Yellowstone National Park** (established in 1872) is considered the **first national park in the world**."
        ],
        "name": "United States"
    },
    "UY": {
        "facts": [
            "This country has the **longest national anthem** in the world in terms of notes and duration, with 105 bars and a full performance time of about six minutes.",
            "It has one of the **highest literacy rates** and **lowest levels of corruption** in Latin America.",
            "It was the first country to host and win the **FIFA World Cup**, doing so in 1930.",
            "The country has more **cattle** than people, with beef production being a major economic activity."
        ],
        "name": "Uruguay"
    },
    "UZ": {
        "facts": [
            "It is one of only two countries in the world that is **'double landlocked'** (surrounded entirely by landlocked countries).",
            "Its ancient cities like Samarkand and Bukhara were vital crossroads on the historical **Silk Road**.",
            "The traditional rice dish **'Plov'** is inscribed on UNESCO's Representative List of the Intangible Cultural Heritage of Humanity.",
            "The country has a very young population, with the vast majority being under the age of 30."
        ],
        "name": "Uzbekistan"
    },
    "VA": {
        "facts": [
            "It is the **smallest country in the world** by both area and population, entirely an enclave within Rome, Italy.",
            "The official language is **Latin**, although Italian is commonly used for everyday conversation.",
            "The security and ceremonial functions are primarily carried out by the **Swiss Guard**, who wear distinctive Renaissance-style uniforms.",
            "It is the headquarters of the **Roman Catholic Church** and the residence of the Pope."
        ],
        "name": "Vatican City"
    },
    "VC": {
        "facts": [
            "The island chain is home to the active volcano **La Soufrière**, which dramatically erupted in 2021.",
            "It is an independent Commonwealth realm, with the British Monarch as its head of state.",
            "The main island is known for its black sand beaches, a result of its volcanic origin.",
            "Scenes from the movie **'Pirates of the Caribbean'** were filmed on the main island."
        ],
        "name": "Saint Vincent and the Grenadines"
    },
    "VE": {
        "facts": [
            "It is home to **Angel Falls (Kerepakupai Merú)**, the **world's highest uninterrupted waterfall**.",
            "The country's name, meaning **'Little Venice'**, was inspired by indigenous stilt houses on Lake Maracaibo that reminded early Spanish explorers of the Italian city.",
            "The region of **Lake Maracaibo** experiences the **Catatumbo Lightning**, a unique natural phenomenon that produces a high concentration of lightning storms.",
            "This country has a strong reputation for producing winners in major **international beauty pageants**."
        ],
        "name": "Venezuela"
    },
    "VG": {
        "facts": [
            "This British Overseas Territory is a global center for **offshore financial services** and company incorporation.",
            "The islands are a premier destination for **yachting and sailing**, with numerous protected anchorages.",
            "The famous rock formations known as **'The Baths'** on Virgin Gorda are a major tourist attraction.",
            "The capital is **Road Town**, located on the island of Tortola."
        ],
        "name": "British Virgin Islands"
    },
    "VI": {
        "facts": [
            "This unincorporated territory of the United States consists of three main islands: **Saint Croix, Saint John, and Saint Thomas**.",
            "The islands are the only place in the US where people **drive on the left side** of the road, although the cars are left-hand drive.",
            "The capital, **Charlotte Amalie** (on St. Thomas), is famous for its picturesque harbor and historic Danish colonial architecture.",
            "The **Virgin Islands National Park** covers two-thirds of the island of Saint John."
        ],
        "name": "U.S. Virgin Islands"
    },
    "VN": {
        "facts": [
            "The capital, **Hanoi**, is famous for its **'36 streets'** in the Old Quarter, each traditionally specializing in a particular trade.",
            "The traditional conical hat, the **'Nón Lá'**, is worn by many people for protection from the sun and rain.",
            "**Ha Long Bay** is a UNESCO World Heritage site known for its thousands of towering limestone karsts and islets.",
            "The country is the world's second-largest exporter of **coffee**."
        ],
        "name": "Vietnam"
    },
    "VU": {
        "facts": [
            "It is often cited as one of the **happiest countries in the world** in various surveys.",
            "The traditional ritual of **land diving** (where men jump from tall wooden towers with vines tied to their ankles) originated here and is believed to have inspired modern bungee jumping.",
            "The nation is home to **Mount Yasur**, one of the world's most accessible active volcanoes.",
            "This country is one of the most **linguistically diverse** places on Earth, with over 100 indigenous languages spoken."
        ],
        "name": "Vanuatu"
    },
    "WF": {
        "facts": [
            "It is a **French island collectivity** in the South Pacific, consisting of three main islands.",
            "The territory is named after the English explorer **Samuel Wallis** and the Dutch explorers **Schouten and Le Maire** (who named Futuna).",
            "Traditional life is governed by a few **hereditary kings** that coexist with the French administrative system.",
            "A main cultural event is the **kava ceremony**, a traditional drink preparation with social and political significance."
        ],
        "name": "Wallis and Futuna"
    },
    "WS": {
        "facts": [
            "This country **skipped an entire day** (December 30, 2011) by moving to the west side of the International Date Line to better align with its trade partners.",
            "The national rugby team performs a traditional war dance called the **'Siva Tau'** before games.",
            "The famous Scottish author **Robert Louis Stevenson** (*Treasure Island*) spent his last years here and is buried on a mountain overlooking Apia.",
            "The traditional tattoo, the *tatau*, is an elaborate and sacred rite of passage, with male tattoos called *Pe'a*."
        ],
        "name": "Samoa"
    },
    "XK": {
        "facts": [
            "It is one of the **youngest countries in the world**, having unilaterally declared independence from Serbia in February 2008.",
            "The capital, Pristina, features the **'Newborn'** monument, which is repainted every year with a new design to mark its independence anniversary.",
            "The country's highest point is **Gjeravica**, part of the Accursed Mountains.",
            "Its official currency is the **Euro (€)**, despite not being a member of the Eurozone or the European Union."
        ],
        "name": "Kosovo"
    },
    "YE": {
        "facts": [
            "The famous **Old Walled City of Sana'a** is a UNESCO site known for its unique, multi-story mud-brick towers.",
            "The island of **Socotra** is part of the country and is famous for its unique flora, including the Dragon's Blood Tree.",
            "It is considered the ancestral homeland of the **Mocha** coffee trade.",
            "The country is situated at the southwestern corner of the **Arabian Peninsula**."
        ],
        "name": "Yemen"
    },
    "YT": {
        "facts": [
            "It is an **overseas department and region of France**, located in the Indian Ocean between Mozambique and Madagascar.",
            "This country is nicknamed the **'perfume island'** due to the cultivation of ylang-ylang and other fragrant plants.",
            "A significant portion of the population (over 95%) adheres to **Islam**, making it the only French department with a Muslim majority.",
            "The lagoon surrounding this country is one of the **largest and deepest coral lagoons in the world**."
        ],
        "name": "Mayotte"
    },
    "ZA": {
        "facts": [
            "It has **three capital cities**: Pretoria (executive), Cape Town (legislative), and Bloemfontein (judicial).",
            "The country is famous for its **'Big Five'** animals (lion, leopard, rhino, elephant, and buffalo), major safari attractions.",
            "The political system of **Apartheid** (racial segregation) was officially dismantled in the early 1990s.",
            "It has **11 official languages**, one of the highest numbers in the world."
        ],
        "name": "South Africa"
    },
    "ZM": {
        "facts": [
            "It is home to the southern portion of **Victoria Falls**, one of the world's largest waterfalls, which the locals call *Mosi-oa-Tunya* ('The Smoke that Thunders').",
            "The country has one of the world's largest reserves of **copper** and copper mining is a major part of the economy.",
            "It is a landlocked country in Southern Africa, bordering eight other countries.",
            "The national bird is the **African Fish Eagle**, which is featured prominently on the flag."
        ],
        "name": "Zambia"
    },
    "ZW": {
        "facts": [
            "It is home to the magnificent **Victoria Falls** (Mosi-oa-Tunya), which it shares with Zambia.",
            "The name is derived from the **Great Zimbabwe** ruins, a massive stone city that was the capital of a powerful medieval kingdom.",
            "The country has faced severe economic challenges, including periods of extreme **hyperinflation**.",
            "The **Zambezi River** forms its natural boundary with Zambia."
        ],
        "name": "Zimbabwe"
    }
}